[{"review_id": "WdWIOycCr-FzQXz6LSHyrQ", "user_id": "kOFFz2Cdeu3vp1kU-BY-2Q", "business_id": "SZU9c8V2GuREDN5KgyHFJw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We encountered a short wait but were called in about10 minutes. We ordered garlic clams, clam chowder, fresh oysters and the crab sandwich. Got photos of most, except the crab sandwich as it was soooo delicious it was gone before I managed to take a photo!\n\nService is ok but super casual. \n\nGreat fresh seafood. Yum.", "date": "2015-06-08 23:55:36"}, {"review_id": "4cnzdvo5invqVavu2GJTrQ", "user_id": "2-4l3YwSaHnVu0LTFM6e1w", "business_id": "B6Lvq3sOYwhKxPzadDka9g", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "Finally made it to this restaurant after hearing about it for a while and it was unbelievable. One of the best meals I've had. I really can't stop telling people about my experience and urging others to try it. It's a definite don't miss restaurant believe me you have to go!", "date": "2013-10-07 13:37:28"}, {"review_id": "YRvFbrPNBCRdl4l5-Ce1eg", "user_id": "Htn0zMg5jDBhp-TRx1dBUg", "business_id": "zun6IVJa7wYe3wAPqWnPGw", "stars": 5.0, "useful": 12, "funny": 2, "cool": 6, "text": "TL:DR: Healthy, fresh, and quick. Tasty if you get combinations right. Best combos will have something savory, sweet, and crunchy.\n\nThis place is amazing. Everyone is extremely friendly and the fish is super fresh for the Midwest. Make sure you keep your expectations in check though, we are landlocked by quite a distance.\n\nYou also get unlimited toppings with avacado and Kim chi being extra. I've had poke quite a bit on the coasts and have found that the best combinations tend to have a mix of something crunchy (chips or fried onion), something savory (spicy poke sauce, Kim chi), and something sweet (Thai sweet chili sauce, mango, or pineapple). My go to combo is white rice w/chips, ahi tuna, crab salad, seaweed salad, mango, green onion, fried onion, sweet Thai chili sauce, spicy mayo, sesame seeds, and togorashi seasoning.\n\nIf you can, I've found sharing a large bowl between two ppl is plenty of food, as long as you both can agree on toppings this is def the way to go and much cheaper than getting two bowls.\n\nSeating in the resteraunt is ample and it's always very clean and well lit. It's hard to beat a healthy, fresh, and quick resteraunt in cwe. People will naturally compare to.blk mrkt eats, both are delicious, but pokedoke bowls are def better than blk mrkt bowls. But there sushi-rittos are different and delicious as well. I believe they can both coexist, in that one day I'll be feeling sushi-rittos and another I'll be feeling  poke and can pick and choose which I'm feeling that day and not be conflicted.", "date": "2017-11-09 17:15:54"}, {"review_id": "tXZ0nExtyeAVKI45D6Ivgw", "user_id": "shN1fTTfVTBEr1Jq8Dj4Gg", "business_id": "NT5S6JV5wPwKOd3s3Yh1zQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fave restaurant forever. Kale salad. Marathon burger. Bartenders who make the happy hour Paloma after happy hour. Dreams.", "date": "2017-11-20 06:23:26"}, {"review_id": "kg_XNpcmEr-sYqM2HCBASg", "user_id": "JwpGFZIf5782bwOPgyrZzw", "business_id": "e0aGg7U132XQRup2qa0Ztg", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was greeted quickly when I approached the counter. The staff is really nice but the place is a dive pizza joint. They have a sign posted stating only customers can use the bathroom but the bathrooms are disgusting. The pizza is mediocre, my slice was extremely greasy and lacked sauce.", "date": "2014-03-19 17:32:08"}, {"review_id": "zalQtRg3InU6-imwUgAIEQ", "user_id": "LFJZ4TqPVBSJNTwO8DKH-A", "business_id": "Y2NFeGtConx1qciSPKcRlA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Reginelli's is a great little pizzeria with a convenient location in Uptown. Their small pizza is portioned perfectly for one if you've built up an appetite whether it be for a casual dinner or a late night outing. Personally, I go for the shrimp pesto pizza with honey Dijon dipping sauce for the crust. Most recently I gave their tiramisu a shot and was very impressed.", "date": "2013-12-08 02:22:50"}, {"review_id": "OF0K4ZQeAOMsgoeh8QkjXA", "user_id": "KnPrhgAtSuUEA4PYSLFDVg", "business_id": "naln1yB9kdFEeZKbHz0qgQ", "stars": 5.0, "useful": 5, "funny": 0, "cool": 0, "text": "Franklin Flea is a great flea market making a fantastic use of an empty building in Phily. At 8th & Market, the location is beyond central and easily accessible via public transport.\n\nInside the vendors are diverse, selling anything from handmade jewelry to antique maps to vintage clothing. Not to mention the Elixr coffee, Luke's Lobster roles and other great food options.\n\nI'm so happy to have something fun to do this winter on the weekends. Absolutely worth a visit - thanks to all who had a part in putting this together!", "date": "2013-11-16 21:38:11"}, {"review_id": "rY-SP2cWuAbYO9b_73f8Mg", "user_id": "exjJwRUxoCEv4sVKHTQ9ng", "business_id": "vR9SKMvXCXyrl6u5ouWHBQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I like how you can see the cook , it's looks nice and clean, cute seating area.  The people working was great. The food was good and tasty plus  fresh . Just wish they devein the shrimps. Next time I will get the beef. I will be back", "date": "2017-03-28 18:07:21"}, {"review_id": "D9bP0so5K9nHbUdJFfWnhg", "user_id": "NmnGpKRiS_nVCHwEvafulA", "business_id": "F8yozE3NWnImNApHO347gQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent service! An absolutely one of a kind experience in the heart of Philly. The best baklava I've ever had! So many delicious courses. We didn't even question what was coming out! Keep it coming! So, so good. Great for birthdays and special occasions!", "date": "2018-03-25 02:00:47"}, {"review_id": "wqZevR-ra-6GKxywe9R1Ng", "user_id": "OmCRtALcCOi1QP274B6usg", "business_id": "W8Z4rXYkmZlEVSaxIVjyvg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "This was a great place for lunch, food was delicious and prices were very reasonable. The service was stellar we received from Melissa!", "date": "2018-03-23 20:15:50"}, {"review_id": "CuLvhQ9gFopBr5CtjaJTIA", "user_id": "LarOkLonzqu5pLzZimS2BA", "business_id": "AdT6vMVYy2uFFfnYbWoAsw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Decor love, service friendly, pizza forget it!!! Amazing the crust is true NY style folds on a dime, ingredients fresh and light! Greek salad flavorful and their Ranch is so creamy.  Hope they add wine and patio! Classic Hendersonville hangout.", "date": "2015-04-29 23:30:44"}, {"review_id": "4-HNLeEQSuHgnoac48GF3g", "user_id": "_g3wHkiWc90oNvd_7TZeiw", "business_id": "j8JOZvfeHEfUWq3gEz6ABQ", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "cool place! the workers are all so helpful, they helped us pick a wine bottle. you purchase then can go outside or upstairs to grab a seat. super chill and awesome atmosphere. sadly it was raining so we sat inside but lots of outside seating and live music. you can also choose cheese and they will bring it out for you on a platter!", "date": "2016-01-06 22:44:33"}, {"review_id": "ay_iT2UfcXTOYj4CpT99VQ", "user_id": "SjVK_GOmA50-k-TnyZsIXA", "business_id": "ioXRE9fGEExhgsZG9m6T-A", "stars": 5.0, "useful": 4, "funny": 1, "cool": 1, "text": "I wish I still lived in Nashville JUST for this salon. I've had my most traumatic cut(super short) and daring (red and then blonde) coloring styles here. I absolutely love it here and would drive to Nashville to get my ends trimmed each month if time permitted. \nThey give great hair advice and carry the best products. If you're out in Hermitage I promise they will not disappoint.", "date": "2015-07-07 19:02:22"}, {"review_id": "Cli6Y2r_K3uictgWvizjBA", "user_id": "6Q8dQGr_DBKcmQ1aXVWvTQ", "business_id": "8SQesFbTE0eWrcGXFCoYuw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Was seated right away and our server was friendly and prompt. Kept the coffee mug full and my egg sandwich was really good. Typical NJ diner, just what I wanted.", "date": "2014-05-27 19:21:18"}, {"review_id": "vjAzL32RnOxykeGhe93RDQ", "user_id": "4foQbwCb5v-G69msa7Jsgw", "business_id": "bXjnfT69E8DJinX-ifOofA", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "As much as I like chicken wings and local restaurants here in Tucson, I don't know how many more times i can stand WOB. As for the wings they are great, always large and perfectly crispy, and totally drenched in sauce. I haven't tried anything else on the menu that I can vouch for. My issue with this place is the service, on the phone it always seems like an inconvenience that I am calling in an order and the call is always rushed. And in person when we are feeling daring enough, the staff always looks like they are in the weeds or behind on all their work. What has brought me to write this review is the mid 30 looking, tall server. Her attitude is unnecessary, her guest interaction screams lack of training and her aura if this counts for anything seems like a black cloud moving through the restaurant. I don't usually let service bother me as long as the food holds up but I just don't like her. And that's that. I'll finish up this dozen of hot, wipe my fingers and contemplate dining in again.", "date": "2016-05-19 15:13:28"}, {"review_id": "3zG94HROyPfPVd_ehtU7Yw", "user_id": "69595iivXKfIiZ1X6ULYgg", "business_id": "CPor0p2hvvHJJN4L0U_zEg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent dog trainer. Knowledgeable, patient, creative. Great experience! Place to go to train your dog or just to make your bond stronger. Highly recommended.", "date": "2018-03-17 18:15:02"}, {"review_id": "jyB89sHIEPXIRCZUdI1mrQ", "user_id": "cqc-QLN0HjcyoERza34HGg", "business_id": "GWUkk9aKgvE4iRbDmJtuVw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Neat, fast and great tasting. Had a very delightful lunch with the wife here the other day. The service was quick, correct and very good in taste. The Tziki sauce was well done. Had good options in regards to meat. Just like a Chipotle kind of concept but locally owned and operated. Try them out!", "date": "2012-08-19 11:28:33"}, {"review_id": "DRLTsYTplqyD7e9FPqq57Q", "user_id": "3xwp79CS524fDtGVE7A3sg", "business_id": "W4ZEKkva9HpAdZG88juwyQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good food.  I had the BBQ shrimp.  The sauce was tasty and good for dipping your bread.  Price per plate was a little high but worth it.", "date": "2017-05-29 15:27:41"}, {"review_id": "eWl0v0FfY267pWS5o82yLg", "user_id": "ARHYoKnoKxduWA-cQb4ROQ", "business_id": "V6Om7YZhlRQRU7WfuxHq8Q", "stars": 4.0, "useful": 0, "funny": 1, "cool": 1, "text": "This was a great quick stop for me during a busy day of touring Philly. Sadly, they were out of beignets when I was there. The portion sizes look small but are very filling, so don't be fooled! \n\nIt took me forever to decide on what to get, and the lady serving us was really patient and kind, and very apologetic about the beignet shortage. It certainly wasn't the best cajun food I've ever had, but for fast casual cajun it was great. FYI: The alligator gumbo comes in the form of alligator sausages.", "date": "2017-01-18 15:48:41"}, {"review_id": "s7UypCU1z63Ys4Q0Z1csyA", "user_id": "Z1ZF20mpWqX2KKhcregD-g", "business_id": "Yh_KhyVD6ZBwsIQQ1wSUpw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "The food is good, service is ok but the owner is NOT a human being. I saw a homeless guy and wanted to buy him some food so the owner wouldn't let him in, even though the homeless wasn't dirty he just had a sign on his hand. Never coming back", "date": "2016-06-23 20:31:30"}, {"review_id": "XKDiJYIn3OCd4a5Fa_99fQ", "user_id": "S877w9D3i1reHcoMg4iE_Q", "business_id": "Yit7GvwzEYbIzkNhxeqC7w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "I went to Audio Itch to get my windows tinted (with warranty) and a front bumper camera with rear mirror display. Their work was reasonably priced, clean, quick, and professional. They have a mini movie theater waiting room with comfortable lounge chairs. I will be taking my cars here from now on.", "date": "2016-10-27 01:39:06"}, {"review_id": "hdNDJP0oPlQ-99dLTa-MBQ", "user_id": "hjhHKl2b02DS6ssWYz_zkg", "business_id": "zLViSytSrWambgwGECNyZA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Coach Andy Reid has to have the worst clock management of any coach. Donovan McNabb is fine but looks like he'll never win the big one. The fans get a bad rap for some incident ages ago when they booed Santa. That aside I like their passion. They care, man!\n\nProblem I have is the Iggles never seem to be a super exciting team to watch. Interesting, yes, but not exactly a high-powered offense at the best of times. Did love Harald Carmichael back in the day, though.", "date": "2010-03-19 17:18:33"}, {"review_id": "e_K4ndyBuHqWiY--HraunQ", "user_id": "cWqtmDX1K3Ph80jYXlGISA", "business_id": "sOcGOqOeObtIBhuvcWuY8g", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "For a dive bar they have some great wings & can make a mean caesar. Great place to stop after work for some cheap drinks & food. No expectations to dress us, just come as you are.", "date": "2015-09-25 21:35:19"}, {"review_id": "jnrNrAiq4X7bBSacCfVPdg", "user_id": "nWepkfrazqoTWkPDdgI1bw", "business_id": "ufscOQH8rFo4BHIHj0au3A", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Cleanliness is an issue here.  It's a great spot for a quick toenail trim but it smells like dog and is full of dust at the front desk and hair all over the floor.  I've heard others say they'd not take their dog here but it not THAT bad!", "date": "2015-08-31 00:03:34"}, {"review_id": "eWQGNb4F4DhoBe7JX1XfUw", "user_id": "6kug763_NIZ6YglzoNhYmg", "business_id": "XHEoP7Otn8RMH9r8WTJnOA", "stars": 1.0, "useful": 2, "funny": 0, "cool": 1, "text": "I purchased a 10 piece bedroom set on November 27th for $4,000 & they charged me that day. I was told it would be 3-4 weeks for delivery. I didn't hear anything from them for a month. When I contact 1 stop bedrooms they told me they do third party delivery & I'd have to contact them which is Ellis Delivery. I did & they were 2 weeks out for delivery & when I call back to reschedule they never have an opening. It's finally being delivered today, Jan. 18th. I was told I'd be the first on the route of the day & now I was moved to the 4th with no explanation!!!!!!  DO NOT USE THIS COMPANY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "date": "2016-01-18 17:02:21"}, {"review_id": "ZR8Y0xzQY0ULDC2QCecF6Q", "user_id": "mQhXGuv08-nQt_4kwqVzQQ", "business_id": "TfcpJBiFNnDaochnmp4M2Q", "stars": 1.0, "useful": 5, "funny": 2, "cool": 0, "text": "What I will say is everyone at this restaurant raved about the food.  They said it was amazing and it was worth the wait.  They also said the red velvet pancakes were amazing.\n\nMy experience was very extreme compared to other reviews.  My wife and I went to the Garden for Breakfast on Feb 13th at 11am.  We waited outside for 2 HOURS!  When I called at 10:30am, the hostess said they were completely full and were not taking reservations.  If I was a walk in- they said it might be 20-30 mins to get a table.  When I got there, she said it could be 45 mins to an hour.  As we were waiting, there were many couples and families that were waltzing in with reservations and it was very frustrating.  2 hours later, I asked how long - and she said another 30 mins.  I got the hell out of there.\n\nPerhaps it was valentines day weekend that causes the busy rush, but no restaurant no matter how good the reviews, was worth 2 hours.  It's too bad too because this restaurant has a cozy, nice feel to it with some respectable clientele - in the most run down part of town.  \n\nNot worth the wait.  We went to Dunkin Donuts instead on our walk back to the hotel.\n\nQuick TIP: All this place would have to do is serve coffee outside to guests waiting to get in and it would make people a whole lot happier.", "date": "2011-02-17 16:06:30"}, {"review_id": "d8sZ5H2mGWzcDcHSM2lHWw", "user_id": "hNt6VproKX1vS_qlwkuffw", "business_id": "y7qvy9LcyK2hr_VcPBiPaQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "I may have an awesome, cool-kid track bike (if I do say so myself), but between us, I'm kinda incompetent when it comes to any sort of bicycle know-how. Or was, anyhow, before I started going to Bike Revs. I bought my bike online, mostly pre-assembled, but knew I wasn't going to keep it stock. The first time I went to the shop, I was looking to replace the original seat and to pick up some wrap tape. I didn't have an exact idea in my head about what I wanted and I was completely blown away by the colorful selection of, well, everything!! I ended up grabbing a sparkley gold seat and awesome seafoam (\"celeste\") leatherette tape. Later that day, I went to my friend's house to have him set up my bike and we both kept talking about how awesome Bike Revs is. \n\nAfter a few days with my new bike, I realized the ultimate flaw in buying online and not trying out the bike first- the geometry of the frame in combination with the stock pedals with cages is totally wrong for trying to avoid getting hit by a turning short bus that doesn't use blinkers. When your foot is in a certain position, the cages make it impossible to turn the wheel at all, so I basically had to jump off my bike in order to not get run over by the short bus (how embarrassing would that have been? Hit by a short bus?? Ugh, it's like a bad joke.). Since I was at 4th and Lombard, I decided to stop by Bike Revs on my way home to switch out my pedals. Meghan(?) helped me out while I made my decision, talking me through the pros and cons of each style for my situation. (Thankfully she didn't even seem to care that I was all sweaty and frazzled after almost just dying!! haha) Since they were out of the particular style/color I wanted and I wanted new pedals immediately, I was going to settle for the same style in copper, but she knew I wasn't really satisfied with them and she suggested that I go check out Via to see if they had the ones I wanted. I love it when businesses recommend the competition so that the customer is ultimately happy. It makes me happy to be seen as a person and not a walking dollar sign. Via did end up having the pedals I wanted and the suggestion actually even increased my loyalty to Bike Revs. \n\nShortly after this, I got a front pinch flat and brought my tire in for a new tube. A few days later when I pinched out my back tire (on a 102 degree day and had to carry my bike on my shoulder all the way from 3rd & Lombard and was, again, embarrassingly sweaty and frazzled), everyone remembered me (even more loyalty points) and when I asked how I could avoid blowing tubes constantly, Bryan took the time to explain why/how it was happening (the skinny tires that came with my bike were no match for the streets of Philadelphia). When I told him that I wanted to prevent constant flats at any and all measures and wanted to change out my tires for more durable ones, he thoroughly explained the tires that would fit my bike, starting with the less expensive brand and not pushing the expensive ones at all. It was my own curiosity that led me to ask about the fancy tires and he pulled those down, along with the less expensive ones and handed me both so I could feel the difference between those and my original tires. Because I ride so much in South Philly around all the tracks and random sink holes that keep showing up everywhere, I decided on the thickest tires that would fit and Bryan then showed me how to change my tubes so I don't have to keep bringing my bike in if I flat out in the future. While he was setting my bike up with my new tires, he noticed that the bigger tires were rubbing a little bit, so he meticulously ground down a new little metal fitting until the tires worked perfectly... on the spot, for free!!! That solidified it- they've got a customer for life! I've had the new tires for about a month and they're AMAZING! I've ridden over all sorts of street surprises with no flats! Not only that, I check my tires religiously now before I go out and I haven't even needed to put air in them since! They're still going strong at 100 psi!!\n\nI had also asked about picking up another pack of my beloved celeste grip tape, which they were out of at the time, and they told me that they would order some for me (also cool). A few days later, I got a voicemail from Meghan (I'll feel like a real jerk if that's not her name), who sadly (but hilariously) informed me that fizik has discontinued the celeste leatherette, but told me how she knew how much I love it and gave me some suggestions of where I might be able to find some. I've been unsuccessful so far, but I'm not too upset about it as I know I'll find something I like just as much on my next trip to the shop.", "date": "2011-07-05 22:23:37"}, {"review_id": "pLFBmVwZeqjvudUczExLww", "user_id": "j0B8nz6TVmLzqYN6lNLiiQ", "business_id": "cV6qQ58k6hPYci5n8jxX5Q", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "Great service! I'm really happy with how my nails turned out! The staff was professional and courteous.", "date": "2018-06-12 23:28:43"}, {"review_id": "KnXz-TVIeBxhHwAhnsIJuw", "user_id": "M34JY9u9riFebVZTAQJGfA", "business_id": "KYlu9adnLdp8_f7ctDBDtg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I bought the Groupon massage as well.  When I called, they said they were booked out to the second week of October and my Groupon expires Oct. 2nd.  Not impressed at all.  It sounds like the massage isn't worth it anyways from the review here.", "date": "2013-09-10 22:50:19"}, {"review_id": "N0SEpi3lSDOMmNdjctk87Q", "user_id": "fCDCgLpxnflyE5LlFtSkEA", "business_id": "ErpOHBaOcmZjnBw0EutQJg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "They have the best bagels in town! I have been coming here since high school and still stop by when I am back in town. The employees are always friendly and efficient.", "date": "2018-10-04 17:53:48"}, {"review_id": "laCK3lJ51uBeLQN_TrIkhg", "user_id": "IPBXsCQIhjXfGGfY4kDDVA", "business_id": "AfassS1QI0DHsqwuof9-lA", "stars": 4.0, "useful": 1, "funny": 2, "cool": 1, "text": "Dirty Franks was the first place I became a regular in Philadelphia. I felt welcome, and it was a fun time. Folks welcomed me to the city, and were very interactive.\n\nIt's a unique environment. There's booths, benches, chairs, stools. Very strong drinks. You'll never be the drunkest one here, and it's easy to find a cab home.", "date": "2010-09-15 16:23:13"}, {"review_id": "i-BQSBiWGRV3hPYm6-Bi2Q", "user_id": "A9cXP_K95FRor1qxuUEu2g", "business_id": "4-y4Jj8hNuVIFktoYnm3-Q", "stars": 2.0, "useful": 4, "funny": 0, "cool": 0, "text": "I had wanted to visit Bella Pizzeria for quite a while. Located in a rather large strip center on East 82nd Street just East of Keystone at the Crossing, Bella Pizza is a four-location indiana mini-chain with locations in Keystone, Hamilton Town Center, Clay Terrace, and in Kokomo. Self-dubbed as a \"New York Style Eatery,\" one can only assume it's because the restaurant tends to be dirty as it's certainly not a description of the pizza. \n\nOkay, I'm sorry. That was a tad too snarky. \n\nBella offers pizza by the slice along with whole pies along with calzones, pasta, salads, breadsticks, a kids menu and some desserts. The location is next to a Mattress Firm  and not too far from Maggie Moo's. It happens to have a couple of accessible parking spots right in front of it, and while they're not quite ADA compliant I'd suspect most people won't have any trouble with them. You enter the front door and head straight toward an ordering counter. They do serve up several specials. I found their slice prices to be pretty workable, though I wasn't as impressed with their whole pie prices. They do offer delivery. \n\nI ordered a slice of sausage pizza, two pepperoni breadsticks and a large fountain drink. They do have Gold Peak iced tea, so that was a definite plus. My entire meal came in at just over $7 - certainly less than you'll pay for mall pizza, though this isn't a mall and they sure don't have the convenience factor going on. You can actually order online. \n\nI will admit that considering their location I'd expect it to be a lot nicer inside Bella. Yes, you have multiple tables where you can sit down and enjoy the meal and they certainly are decked out in the usual New York urban decor, think a grittier Subway, but it all seemed a lot more kitsch than I expected. \n\nI've seen a couple Yelp reviews refer to Bella's pizza as glorified mall pizza and, quite honestly, that's an accurate description. The sausage was chunked, which is fine, but it clearly wasn't fresh and it was barely warm. While I expect this in a mall, when I'm actually in a functioning restaurant I do have higher expectations. The pizza wasn't bad, but there's definitely no way I'd go out of my way for it. The pepperoni breadsticks were warm, though they lacked anything distinct in terms of flavor. I suppose for $7 it wasn't bad, but since I was splurging a bit on my diet I really was hoping for a tastier splurge. \n\nBella's was semi-clean. It certainly wasn't divey, but I couldn't help but notice with 3-4 employees working and about as many customers that it seemed like socializing was a higher priority than actually cleaning or keeping busy. They weren't unfriendly and I didn't feel neglected, but with a little interaction with customers they could have really created a much more positive dining experience. \n\nWith Indy really possessing a pretty good pizza scene these days, it's hard to fathom a good reason to return to Bella's. The employees didn't seem to care that I was there and, quite honestly, if you can't serve me a simple hot slice of pizza then you're really not worth my hard-earned dollars. With Napolese in the mall across the street and Puccini's not that far away, when I want a good meal I'll visit them and when I want mall pizza I'll actually go to the mall.", "date": "2015-08-08 02:25:03"}, {"review_id": "4ZjFHIsqt7nOg4UaDN-ktA", "user_id": "eWvYocztrgv-LfQiyxo4TQ", "business_id": "wHiPhPVuGnngEieDBMG00g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "See my \"tip\" for the beginning of this from July15...  Okay, I dug into the sandwich... :(  First of all it was supposed to come (as per the menu) on a \"crunchy rye hoagie roll\". It came on a cold white roll. Then when I asked for the rye, I was brought the same filling (now cold and not much compared to the bread!) on a cold wheat roll. When I questioned about the rye, I was told \"that is our rye.\" I know rye and that wasn't.  :(                                        \n I still love the pizza, pretzels (same dough as the pizza) and the red sangria, but I probably won't venture to try another hoagie.", "date": "2014-07-17 21:58:06"}, {"review_id": "HPu8Y3JM42nPDMV7qwdrkQ", "user_id": "n3nU25sYPN70KDu65z1LyQ", "business_id": "M0c99tzIJPIbrY_RAO7KSQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great location. Hotel is clean and well kept. The view from my room was outstanding! I could see the arch right outside the window. The lobby was nice clean and modern. Having Starbucks inside as well as Ruth Chris steak house was also a plus! Doormen and valet guys were very attentive and polite. The only reason im not giving this establishment 5 stars is due to the wait to check in. We had to wait over 3 hours untill our room was ready. Beside that i would def come back to this hotel.", "date": "2016-09-20 17:15:50"}, {"review_id": "i28hlOhX9KcjletZbGxtmQ", "user_id": "mq6lB4fGquPmBbGc-yvZjg", "business_id": "8QfKPqOxKmt3hg2863hAJQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "They were great! Had a new person training and they even gave me the left over but smoothie in the blender! First time I've had that happen to me anywhere! Sweet!", "date": "2018-01-13 22:36:08"}, {"review_id": "N_wfCKIPLBk2ySi_QS5TXA", "user_id": "1qK7UbWZ8RY5t_vFrP56RA", "business_id": "5Y_TiS_KJAgJMf9ZiKutEQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "A great local tavern with some unique variations of the typical burgers and sandwiches.  For the most part, the food was terrific.  The service struggled a bit to keep up with the demand and the live music was terrific, however, made it difficult to talk and enjoy the company of friends who were at dinner with.", "date": "2017-01-30 20:41:39"}, {"review_id": "33rDHrhAd7X_xeEyoFjz5A", "user_id": "2anfbsmeoqeMYCiNwUow9Q", "business_id": "PY9GRfzr4nTZeINf346QOw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Always a wonderful experience.  We never stay anywhere but the Peppermill because the hotel is consistently outstanding.  The rooms are beautiful, the staff is extremely professional and the restaurants are excellent.  The Peppermill gives you the Las Vegas experience without the long trip. . . and without the ridiculous crowds.  (Now if only I could learn how to win on the slots)  LOL", "date": "2013-06-24 23:09:24"}, {"review_id": "TTvDBSjlhHHE_c7tPykgvQ", "user_id": "nVU1BEo1lUMQBDuL_EFf5A", "business_id": "0ndzIekJs0PRPA5Aoz9sow", "stars": 3.0, "useful": 1, "funny": 0, "cool": 3, "text": "apparently i'm the only one who doesn't think the beignets at morning call are better than the ones at cafe du monde.  i like someone else to regulate my powdered sugar, i guess.\n\ni do, however, think the coffee here kicks the crap out of pretty much anything you'll find in the area.  heavy on the chicory.  yummy.", "date": "2007-12-14 00:14:10"}, {"review_id": "QGiegqOVdopCbU1jMQELYA", "user_id": "9kbV0gn3Ea2eAMV-Z_eX8Q", "business_id": "MpkCQTOV6D3XGRPbtQPj5Q", "stars": 4.0, "useful": 3, "funny": 0, "cool": 1, "text": "I think I have had this place bookmarked since I moved to Indy..never got around to checking this place out until a couple of my friends and I met the owners. All the dishes made here are their own family recipes. \n\nIt was pretty packed at 2pm on a Saturday, but we only had to wait 5 minutes for a table to open up. It's a really small space, but clean and I'm always a fan of loud restaurants. We did have a little wait on getting our orders in; the co-owner/hubby of chef seems to be the only server. My girl friend and I ordered spring rolls, Vietnamese chicken wings (for her 6 year old), Pho tái and Pho tái chin (when we got our bowls we couldn't tell the difference...). The 6 year old really enjoyed the chicken and was pretty proud of eating everything off the bone. My Pho tái was very tasty and I'm so pleased at the super large portions. Nothing like a hot bowl of ph on a cold day!\n\nWe finished our meal with bubble tea; it's not the best bubble tea I've ever had, and I certainly have never had it in slushy form, but it was still pretty good. I only wish it had more tapioca pearls.\n\nOverall I enjoyed the whole experience--and I will be back! I want to try a Vietnamese sandwich or a rice noodle bowl.", "date": "2015-01-23 16:33:22"}, {"review_id": "4o1sI-ftyVr160L91Ke8Zg", "user_id": "aflOM2zIrezsIRWd1D5OuQ", "business_id": "1n1TzHTD2xLcyOPGV4b2-w", "stars": 5.0, "useful": 8, "funny": 0, "cool": 11, "text": "Dr. Stevenson - you are a magician!\n\nOn Monday of this week, I pulled something in my mid-back. I work from home, so I sit for 12-16 hours a day. Needless to say, my posture slips sometimes. I also work out rigorously, so sometimes my back acts up.\n\nAnyhow, I was doing a small chore around the house on Monday and I felt a pull in my back. It got progressively worse on Tuesday. At one point, I couldn't even sit. I felt paralyzed for a bit. It was terrible.\n\nMy girlfriend called to make me an appointment on Tuesday & they slotted me in on Wednesday afternoon. I filled out some quick paperwork and met Dr. Stevenson.\n\nHe described the anatomy of the back and ribs to me before going into the treatment. He pointed out how my hips were misaligned which most likely led to my back issue. He also worked on my neck and pelvis. After 10 minutes in his office, I walked out feeling 100 times better.\n\nI particularly enjoyed how he described every part of the process to me and really explained how every part of my body is connected to the other. So, a mid-back problem may be a hip problem that has extended up - it felt great to learn the true reasons behind my pain so I could try to prevent them in the future.\n\nIt's now Friday and I feel almost 100%! I worked out yesterday with no pain and have been very mindful of the preventative recommendations he gave me.\n\nTotally recommend going into this office if you're feeling some sort of back pull or chronic pain. He's very good about treating & educating you so that you can hopefully prevent it moving forward.", "date": "2016-02-26 18:54:59"}, {"review_id": "q2zPKtW-thQuAXUiTU4Uqw", "user_id": "KoLUsGxu4aVGI6jLjjB02A", "business_id": "Yll7kUVI7j0gArBMQKpEaQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I'm always on the hunt for a tasty dairy-free latte and theirs (almond/coconut milk blend) is definitely one of the best in Nashville! Will definitely be back.", "date": "2016-10-28 21:00:43"}, {"review_id": "Tb07UEPbKhNmKf7Py_popA", "user_id": "gpBnOMN1wEP-XFTGGPM3Ew", "business_id": "Sh5x88Ty9NGgMvLoIKxAiQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Let me start off by saying we are Not big drinkers so a night out for us consist of two  to three drinks and we start to feel a good buzz. So it's our first time to Nashville we head straight to Broadway on Saturday night. Want to get a good buzz going and enjoy the atmosphere and town. . The place is beautiful, very modern. Sat in the second level bar had the Buckshot and 2 jack and cokes to follow.  All I have to say is SUPER weak drinks!! Paid about $75 and felt Like we drank water!!!", "date": "2018-06-20 09:37:05"}, {"review_id": "_OZPWJU5yYkuaXj8wV_fAw", "user_id": "DbxWG41pi8mrrwH-0TbUYw", "business_id": "ZDg4siM2zLF4Rt8ZTqR8BA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "100% Best Deli/Hoagie Spot in the Main Line! This place is special. You want a hoagie you will never forget? This is the place. Expect a wait during lunch because this neighborhood deli has a reputation for being a delicious and affordable place to go. It's a family business in a family town and I'm always treated like family when I go there. If you haven't been here, you really are missing out!", "date": "2016-09-08 14:37:57"}, {"review_id": "hu_mry0oMMKrPUU2Ycw1Mw", "user_id": "tAsrcTNoT0pAJzKUQBHp0A", "business_id": "bCIZeggW02uPdz2lobSjUA", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Headed here Saturday night with friends for food and drinks...only they aren't serving food, yet at least...the ambiance is nice, it reminded me of a more European feel (no bar stools). The Bartender was very friendly and called us \"friend\" they did serve us a small shepards pie as a snack..my friend from England was not impressed, said his mother made it better but I have never had it and thought it was pretty tasty. I think i will let them get a bit more established and try it again.", "date": "2013-09-08 23:58:48"}, {"review_id": "ekmKB9kOOJhjnwf6SipAlQ", "user_id": "jIWa0gZ_By5_lbyPREfsqQ", "business_id": "IBl6b1zPNo36aqV4h7vQ_w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great!  Clean and tidy, which is more than I can say for a lot of Chinese places. They've definitely done some upgrading. Salad bar was completely stocked and very clean. Because it is a buffet, I was worried about food sitting out too long. But it wasn't!  Hot and fresh in all cases. Peanut chicken was the fav. Will definitely be back when in the area.", "date": "2017-01-04 00:28:55"}, {"review_id": "OKa9uhjJTlyGmiXCTagLRw", "user_id": "1u4b-wZrpLc8TlBxG_Wm-A", "business_id": "SZU9c8V2GuREDN5KgyHFJw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good food. If your like us and like the Crab Back and stuff. Make sure to let them know before hand. Otherwise they clean it all out. They did provide us with a bowl of it after we mentioned it. ;) Uni is very fresh, scallop ceviche is kind of a cheater since it was sitting on a bed of cabage", "date": "2017-10-03 18:51:58"}, {"review_id": "HU5KYqw6ofNpGTh3OypatQ", "user_id": "1yXVKvK7uYjAZnonIl3jNg", "business_id": "YjRsQ94c3wpUQbsnU9jhHA", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "After hearing about FTS from some friends, we had to check it out. As we currently have two train enthusiasts in our midst, this was a home run!\n\nEntering, you're greeted by a HUGE train set with all sorts of trains to play with. Naturally, our three year old gravitated towards the 3 engines another boy was playing with rather than the 50+ currently not in use. After a discussion about the importance of appropriate social conduct and the need for personal space, we proceeded to play for the next few hours on one of the four huge train tables. \n\nThe walls are covered with just about any popular train toy your little, or you kiddo's little, heart may desire and is great place to stock up on birthday and Christmas gifts if the little ones are into this sort of things. Plenty of engines, tracks, cars as well as tons of books, puzzles and games made it a great spot to see what's available currently and get ideas of later in the year. \n\nGreat place to come and spend a few hours on a rainy or nice day. Very nice folks running the place as well. Don't feel like standing? They've even got a bunch of seating for the adults while the little squirts run off some energy! A great place to check out for any and all train enthusiasts!", "date": "2015-09-11 03:47:26"}, {"review_id": "EH9ZVN4KKXoVueosPYj2Ww", "user_id": "U2k_kx0iMwJJdvOJSI_r4g", "business_id": "yJKPxrrQO1Ycp0jKO91t9w", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "If I could give this place zero stars I would! I made an appointment for 12:00pm, when I arrive the stylist said she was running late and had one customer in front of me, (okay great I was fine with that). I walked back to the waiting area and there was no where to sit and various kids running around, spilling juice on the floor. I WAITED FOR 2 HOURS AND A HALF, then walked to the front of the salon, and the owner happened to be behind the register. I told her I had been waiting for 2hours and a half and she said, \"it's a first come first served!\" I said I made and appointment and she said \"oh well there was someone in front of you and she is still in the chair and it's her birthday.\" I DO NOT care that it's her birthday, I care that I have been waiting 2 hours and a half. The owner was VERY RUDE AND did not care. So I left and walked down the street to the weave bar where there are no children running around and much more professional.", "date": "2017-03-18 18:42:47"}, {"review_id": "QS0J_PoHPnuaDtx717l-tQ", "user_id": "oTKRL_kcvzxZYyB4J2NF3Q", "business_id": "Ms5xG8i4p80KSMcF3tt4ug", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "It's consistently good and priced reasonably. I prefer to go here for lunch. You really can't beat a salad, main dish, and a side of pasta for $8.95. \n\nThe portions are reasonable, I'm always able to finish what I ordered and I leave feeling full. Proper portioning gets an A+ from me and Gordon Ramsey. \n\nOn my most recent visit, which was at lunch, I had veal and peppers. It's a dish I typically lean towards because it's a classic that I can't make at home. I was a bit disappointed that there was only a few chunks of veal on the plate and the rest was shredded into the sauce. I didn't order a veal meat sauce, so I really did expect veal pieces. That being said, I've had it where it's been all chunks of veal. The red sauce, or gravy, or tomato sauce, or whatever they call it- I'm too Polish to understand the Italian naming of a simple tomato based sauce- is spectacular. I really do think they have one of the best sauces around. It's the reason I order the veal and peppers. No way would I be able to make a sauce so flavorful. \n\nI've also had some bad experiences with the wait staff. Sometimes they don't ask if you want pasta or vegetables as your side- during my most recent visit I was assigned pasta while the rest of my table was asked which they would prefer. Sometimes, like today, they forget to refill beverages. One time, the waitress actually told my boyfriend that he shouldn't order a sandwich and directed him to something she believed would be better. Granted, she told us she never actually tried one of the sandwiches, but loved the chicken entrees. In my mind that's completely unprofessional. \n\nThis place isn't the best in terms of decor or wait staff, but for the price and the quality of the food it is worth every experience. I really believe it's run to cater to corporate workers going out to lunch. I've found that lunch is what they're good at and there's always a lot of people obviously who came from the office.", "date": "2015-06-23 00:39:49"}, {"review_id": "ZZFjGBiJZLrWFrLxQlxSbw", "user_id": "oWtwTCLsdYuoeTduJnNEDA", "business_id": "X_E7U2lVNEwbH_gpOBmAHQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We stopped in for a couple of drinks and tacos were so good! The steak tacos are the best. Guacamole is a must. The atmosphere was great and warm. I love all the wood and decor. Great live music", "date": "2017-01-16 22:37:27"}, {"review_id": "4pIUDoeZ9uYED-HOuGK0-g", "user_id": "QjP_u1S__spN5E-fxz8Fog", "business_id": "KMQrA590JiprwoOnu4UKVQ", "stars": 2.0, "useful": 2, "funny": 4, "cool": 0, "text": "My boss was stoked when this placed opened back up after renovations...We've had it several times in the last few weeks.\n\nThe 30% off \"re-opening\" special was a really good deal.  \n\nPark has a nice selection of Chinese and American cuisine.  The actual salad bar is really fresh.  As long as you get here before 1pm, there's quite a variety -- any time after this they start removing pans and the selection is much more scant and sparse.\n\nUnfortunately, I don't think I'll be able to go here anymore as the last several times there have been hair in my food which honestly makes me want to puke just thinking about it.  The first time I convinced myself it was one of my own hairs...Then the next time I convinced myself it was a cat hair.  I can't do it anymore.\n\n*vomits everywhere*", "date": "2015-02-02 20:27:45"}, {"review_id": "VPD1oP7ShPFRTsepWzZiFQ", "user_id": "57uaaEBMcuYvCktdpbv5Tw", "business_id": "BjBDHqHhMXSxgyVipccznQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Just had my daughters graduation party there this weekend. We had 12 guests in the Harbor View Room. I planned the whole event over the phone and email from NY, Katherine in catering was a delight to work with and took care of everything. The party far exceeded what we were expecting, first- the place is beautiful, and was decorated for the Holidays. The room was set up perfect, so much attention to detail went in to making our party perfect and my daughter feel so special. The food was so delicious... every guest commented how good it was. The drinks were excellent and very plentiful. The waiter that took care of us that day really put our experience over the edge! He was attentive, so polite, and just a pleasure to work with. I can't wait to come back to Tampa to eat here again... by the way the Filet Mignon beats any steak house in NYC ! It was perfect- fork tender! I can only imagine how beautiful a wedding would be there. Thank You Rusty Pelican for making this a very special celebration!", "date": "2017-12-17 19:33:28"}, {"review_id": "5hjk64-SBPCKiLcdHAM-6A", "user_id": "O9nc17ajtkGUdsRJ8ViB9g", "business_id": "-dsxu0V5X7OD17i8HcQovg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "VEGAN JUNKFOOD DELICIOUS!!!!!! Who knew you could get a cinnamon roll that taste so good, just so good and it's cruelty free, total WIN WIN! #stayWOKE", "date": "2017-12-05 04:46:28"}, {"review_id": "wPzKdnr8f2hg69GaxHJveQ", "user_id": "Awij63K7MTADDAZWoEZQ8g", "business_id": "z55MjytBCcIza_LFT73Lzg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The breakfast sandwiches are to die for not much of a selection of hot meals but I was disappointed in the Cuban sandwich doesn't seem to be too authentic not enough roast pork the roast pork was sliced ham sort of a roast pork and there was no mustard on the Cuban sandwich which an authentic Cuban sandwich has mustard on it but the empanadas are to die for and so are the stuffed potatoes overall good place to eat", "date": "2015-10-25 16:10:18"}, {"review_id": "0FC2rZ2aKu-0kyjiS7dqwg", "user_id": "ivuSlwwPimN3-zbpL6d4pA", "business_id": "uO39--k_hrCFgZh-Bl8m8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great traditional Mexican tacos. Favorite is their mixed alambres. Perfect for lunch! Well priced for downtown.", "date": "2017-01-04 04:18:28"}, {"review_id": "CLGuohNdh2_FWF5nakClsw", "user_id": "U6sw3hX7RApzrOmYCax7Pg", "business_id": "-RWaEQ6EiaDs5rB_jFWzpQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Karina and her husband her amazing and patient with our little stubborn baby that kept crossing legs! It took a while to get the gender picture but they did! The office is nice and inviting and perfect for families that would like to sit in and watch live on the big screen in the other room. We would definitely recommend this place to friends and family.", "date": "2018-03-06 20:08:19"}, {"review_id": "1Ad9y7pIHS1D_i6BBYdD6g", "user_id": "x5_wSiB2y5lXCFp8WlGf1A", "business_id": "50hxVwLOYDSlNZq8QvarcA", "stars": 4.0, "useful": 3, "funny": 2, "cool": 4, "text": "I guess you could consider me a \"loyal\" customer because I haven't been to any other smog place in town since my short time here. \n\nSide rant: I'm from Florida. I don't know anything or WHY Nevada is all about this smog business. I think its just to generate more revenue for the DMV who makes out like a bandit with cash. I guess its just the stubborn Floridian in me that doesn't want to be told that I have to go the extra mile to prove to somebody that my car isn't leaving a remarkably large footprint on the environment.... okay end rant. \n\nSo: My experience with Q's Quick Smog is just about as brief as I'm going to write in this review. This place is easy as pie, the guys working here are quick efficient and KNOWLEDGEABLE (even with my dumb floridian questions), I've never had any problems, their prices are competitive, and its close to everywhere else I go.\n\nSo, there it is yelpers. If you just finished reading this review and are currently at this location waiting for the check to be completed..... its already done.", "date": "2016-06-23 02:06:48"}, {"review_id": "igibNNtdS3Af1ZN1LNIVxA", "user_id": "pz-11EN5V_73Wi1qGon4uw", "business_id": "kKPJLiHIr9Gd9sYs3GhxDQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Service was out standing! I loved there small sidewalk cafe. We shared some small plates among the three of us. They had several vegetarian options as well. Oh and you MUST try the home made pasta!", "date": "2017-09-02 22:00:47"}, {"review_id": "rNdDgvzV0q_NB59g8Zt2yQ", "user_id": "ZstTo1OpzggAGJn5K07TBg", "business_id": "oaboaRBUgGjbo2kfUIKDLQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was out in Nashville this past weekend and was craving ice cream.  Without knowing anything about Mike's I walked in and looked at the different flavors.  I decided to go for the cornbread black berry ice cream in a sugar cone. It was so good!!! Ice cream is one of my favorite foods and I don't say that about many ice cream joints. If you're in downtown Nashville craving a late night ice cream, do yourself a flavor and check out Mike's Ice Cream!!!", "date": "2017-05-04 17:21:53"}, {"review_id": "Prl6PHNMgLNC6S-e6v8-Fg", "user_id": "S2yp8AV_H1o2fOag0vPA8Q", "business_id": "eBGWJYj9meGtvgw0Tm7KwA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is by far my favorite place for Raspados and more!  I tried all kinds of place in Tucson and this place beats them hands down..... the elote(corn) is freaking awesome and the raspados are so fresh tasting and ice cream is delicious.  I'm glad I found it, we will definitely be back,", "date": "2017-02-11 01:45:14"}, {"review_id": "KU7QB3J5kdQ1aF5HXU_flA", "user_id": "tAZHpuml1t3QlsIcEile5Q", "business_id": "bmz4siaejdjs4_yS_mYW4A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have had lunch at Cool Springs Brewery one day a week each of the last six weeks. Every week I order something different. I haven't been disappointed yet. The service and the atmosphere are great \nIt's always a pleasant experience.", "date": "2018-05-28 20:38:31"}, {"review_id": "S8FLvcKGWctZffPxd1mcAQ", "user_id": "-U-bPA7TKaOw6iti7RRC4g", "business_id": "Z4Yfcktc-2RhNprA6l35lg", "stars": 1.0, "useful": 4, "funny": 0, "cool": 0, "text": "Short and sweet - Been here three times and haven't been impressed. This last time I called in an order. The guy taking my order was rude and not helpful. I don't know the menu and asked him some questions and he knew about as much as I did. When arriving to pick up. Had to look for service. Was surprised by the 27$ bill for one entree. Got home, missing salad, over cooked steak, over cooked fries. Never again. Hope not everyone has that experience! Good luck. \n\nP.S bring your cash cow. This place is PRICY especially for the quality of food", "date": "2016-01-30 05:02:25"}, {"review_id": "fKy8b1k6KknAyHxP62zmkg", "user_id": "HOy4vtxyF-UD9bv9jmZGEw", "business_id": "n1HOCV74TBVZdQdOUgp9xA", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "I'm a big fan of Moe's and have always had good experiences at the other locations. We were recently shopping at the new outlets and decided to grab some Moe's for lunch. Sadly, I was shocked at how different this place was compared to the other ones I've been to. The place was filthy. The tables were all dirty. There was old food on the floors under the tables too. I had to wipe down my seat before eating. My husband and I both were shocked that none of the employees were even paying attention to this. The place wasn't crowded at all so its not like they were working on orders. I hope they get their act together. In the meantime, I'll be giving my business to the Moorestown location from now on.", "date": "2015-09-13 03:20:11"}, {"review_id": "G1C3WLJwQYLOe-DFbrNB1g", "user_id": "WKfTHHmUchXI_zedwF_kxA", "business_id": "OHzX-ZD9qyoeoxR8Z0dlIA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great little place to grab some great food, drinks and a chill atmosphere. Yes there are some amazing vegan choices also. Try the amazing Mac n cheese and the peanut butter bomb!", "date": "2016-07-05 20:10:19"}, {"review_id": "DqizqddTM0UU9s-XvDweIQ", "user_id": "vPM95ybPSLyUkeHPycRcUA", "business_id": "pCmaISSyKum22MOtPOxL-w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Hear a lot of talk about the Sixers...Eagles and Flyers...it's early but look at the Phillies...plus the ball park is the best in baseball.", "date": "2018-04-16 04:57:23"}, {"review_id": "Qxdv-hpvSCpd_LtgJ0EG0g", "user_id": "7OUAzKZj6LUrQ3G7g7yUSw", "business_id": "1T6X5DvsMezSGCfJ8K11gw", "stars": 3.0, "useful": 1, "funny": 2, "cool": 0, "text": "Ed's is where I tend to end up on first dates. I live on the west end so it's convenient and bowling is always an ice breaker--I mean, nobody looks cool holding a bowling ball so it instantly levels the playing field.\n\nThe staff is usually really good and friendly for the most part, I can't think of an instance where I've had bad service. The only really puzzling thing in this place is why they have so many lanes when they never have all of them open. It's like check out counters at Wal-Mart... an endless supply but nobody ever manning them.\n\nAnyway, the recent renos look good, the bar area is really nice now. The bartender last night was solid, he took good care of our birthday party group as we waited two hours (!!) for a lane. Everybody who had food said it was great, too. \n\nThe bowling itself was super cheap, another bonus. There's nothing worse than a really expensive first date, especially if it doesn't lead to a second one.", "date": "2014-12-08 03:11:37"}, {"review_id": "mU9irpNomYHbtvMkKlBoLA", "user_id": "E2CuwvUZdhvrAvvNdmmN8A", "business_id": "lZEYIL95hZsZS0vgaoR2aQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Been here twice for lunch now.   I feel guilty when I leave.  The lunch special is a one-item pizza and salad and I think my bill came to like $5.72 with tax.  Crazy cheap.\n\nThe pizza is very good -- crust and all.  The ingredients are top quality and everything tastes great.\n\nThis place definitely worth a stop for lunch.", "date": "2013-07-14 22:20:22"}, {"review_id": "Qg5uNtrMMtu-x3dvklVd-w", "user_id": "Q3vR_w-UY8xjQfJXgtR6fg", "business_id": "KP5OncF2jhT7_J1phHPPww", "stars": 2.0, "useful": 1, "funny": 2, "cool": 1, "text": "The food is not really authentically Mexican. I liked the cute idea of the little doll to put under your pillow to scare bad dreams away, not sure it is related to the Mexican culture though. I was hoping for something truly Mexican. The service was just ok, not too knowledgeable about their food items.", "date": "2015-05-26 16:38:56"}, {"review_id": "9ew7Cp40N3z2AFq8qSD_kA", "user_id": "HNLMtsSqzhACSTXzuIlMsA", "business_id": "2rQFgavS-942RapZTBSBTw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "The service is going to be slooooww. And the food okay. Do not come here if you are with a group more than 4 if you have to be anywhere because it will be slow. \n\nI came with a group and we were the only ones around and the service was still a mess. There were multiple servers around who watched one server struggle. I felt bad for her. She was making drinks, serving, and running food.", "date": "2017-10-02 01:52:47"}, {"review_id": "2IhYvHHuEWtd4fhCPlxejw", "user_id": "_bZ0fZPl1StkIzMtYmtm1g", "business_id": "haTwYzufFqFb2sq6CHwOEQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not the best experience I had the Thai Shrimp Salad. I would just say I am reminded why I never go to this Applebee's.", "date": "2018-04-08 01:43:51"}, {"review_id": "zJTrqz6Qv0FtpBn6BQnfMw", "user_id": "OztY8EJEkimKr3F3x3Q99w", "business_id": "E-4t5Hoon6aVFTWDPz26fQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best biscuits and gravy in town at a place that also serves AMAZING Mexican food?!!! Yes! Great coffee too! I have never had a disappointing time here and I've been coming since the first day it opened. Now they have a tequila bar too", "date": "2018-07-09 13:47:07"}, {"review_id": "S0aiLzI2ipw9NyMdThdeww", "user_id": "wb8_tvkNktRHTEb63A2oiQ", "business_id": "cxupofYLq46bxBHpKyFwsQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Our stay was great for one thing, only 2 elevators where working.  The room was large and clean,  The ice machine on the floor was not working.  The staff was nice.  Check in and out was quick.  It is great location for the French Quarter.  The restaurant at the hotel is ok, but there are better places a couple blocks away.  We will be going back in April.  \nThe seafood buffet at Harra's is as good as anything in Las Vegas.\nIf you are a fan of fried chicken try Willie's Chicken Shack.  The best chicken I have ever had.   Thanks to our cab driver.", "date": "2015-10-09 02:00:00"}, {"review_id": "2iDGKFZhit80lnkYHtI7qA", "user_id": "zBWSORvlWDmwtcx6627qWQ", "business_id": "sGy67CpJctjeCWClWqonjA", "stars": 2.0, "useful": 10, "funny": 0, "cool": 2, "text": "I have driven PAST Blake's in Deming, NM on my way out of Hatch so many times and always thought to myself, \"Huh, I really should try them out.\" But I never do because I just want to get home to Tucson and to be honest, 9 times out of 10 I just put a Sparky's green chile cheeseburger in my belly so I wasn't hungry. When Blake's came to Tucson, I was really excited!!!\n\nDon't believe the hype. The green chile cheeseburger at Blake's is a mediocre burger overall with the saving grace being the green chile. The green chile is delicious but not very hot, at least for my taste but that's not where I find fault with this burger. The actual burger is greasy and just a whatever burger. Mine was thrown together so sloppily that I had more onions and tomatoes off the bun than on it. I literally had to put my burger back together before I could eat it. And then the grease started dripping off my hands. Honestly, I would compare the \"burger\" part of my sandwich to any old fast food place but priced much higher. We also had seasoned fries which were good and onion rings which were not. The size of the order of onion rings for the price was NOT a bargain at all.\n\nSo I'm glad I finally tried Blake's but I really don't think I'll be back. Especially when the green chile double cheeseburger I had at Whataburger was actually better but then again, my judgement on that one may have been clouded by a hangover.", "date": "2017-09-11 23:43:25"}, {"review_id": "9kTPvf9pgIJV1CQrnqFdGA", "user_id": "-9wZ5ndiE6jEVet0j7PKXw", "business_id": "uI15YInpDsGBUZcNfm_TfQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great pizza, great salad and most of all excellent service. This is a family owned and run restaurant and they are so friendly they\nmake you feel like family.  The thin crust on the pizza was baked perfectly...not soggy anywhere; perfect amount of cheese, perfect amount of toppings.  The salad was great - no dressing needed.", "date": "2017-06-17 22:23:46"}, {"review_id": "w1-iq_LKFi6oKoJ4s5l09g", "user_id": "nXOcaIBwRWnlRk8hR9u1wQ", "business_id": "MGcO_SQmxO6_dAExkosJcA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place \nAwesome doctors \nStaff is helpful \nThe place is busy which means he is popular (after all who wants to eat in an empty restaurant).\nIt's clean and friendly.", "date": "2017-11-09 03:08:33"}, {"review_id": "Jpz3ak6pPv5Z1xhW6L9NzA", "user_id": "udrDpLKCPEUX5_J9CBJXLQ", "business_id": "cZTFav6cyVQWw1RaHrKtgw", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "This was without a question, one of the best sales and delivery experience I have ever received in my life. Below I will explain why I say that and how it came to be.  What I want everyone who reads this review to understand is a few simple strategies. 1) Know what you want before you go to a RV dealership; 2) Do your due diligence on choosing Make, Model, Options and the Fair Price you will pay; 3) Order the coach so you have time to sell your own if possible; 4) Don't be in a rush; 5) Have all your communication in writing and if something is missing, take responsibility that you did not prepare prior to your commitment.  \nAll the above is what I did.  Why, because I read every blog I can find on the subject, watch every YouTube™ video I could and listen to folks who have been RVing for decades. Every single part of my requests to Tampa RV were fulfilled prior to me even setting foot in the dealership. My sales consultant, Stephen Weaver, communication with me consistently throughout the ordering process (three months).  Everyone from the General Manager to the PDI manager called me prior to delivery.  Even the dealer sent me an email after I took delivery.  \nFolks, every aspect of my sale to delivery exceeded my expectation.  Thanks to the entire staff of Tampa RV for working so closely with me.  My hopes are everyone does their research and preparation prior to even thinking about the purchase of an RV from any dealership.  Bravo to all involved.  See my addition comments below for more information.\nThis not my first purchase of an RV/Coach.  Prior to every transaction, I do a level of due diligence that most people can't or are simply not willing to do. In the past I have been asked to speak on the subject at national conventions, pod casts, YouTube™ reviews including my own and my personal blog on the RV Industry.  My goal is to be a advocate for clients to have a seamless and transparent transition with most RV dealers in the United States. I am called the \"RV Advocate\".\nOn to my review. When I finally choose my brand (AirStream), model (Interstate Grand Tour) and option package (Tommy Bahama) it was time to choose my dealership.  Since I had purchased an AirStream Trailer prior, I had gone through this process before.  It seems my prior dealer did not communicate some critical facts to me on my potential new purchase, so we parted ways as friends. My money, so my choice. I knew every single Airstream dealer is a five-state radius.  I had visited most of them. I was referred to Tampa RV (A member of the RVone Group) by a trusted Airstream friend. Tampa RV's reviews were not stellar to say the least, but I studied them very closely.  It became clear to me the issues, not only with Tampa RV, all RV dealerships I dealt with was \"professional communication\" on both the client and the dealers side.  I created a process in writing to leave \"no stone un-turn\" and the result was OUTSTANDING.", "date": "2017-12-06 00:34:10"}, {"review_id": "G0KX2tGRfm-YhTihhkr90A", "user_id": "JDneArtJlNjtdyx8y6iiMA", "business_id": "62pABDhLkUPAcNgxum_mpw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My favorite part was the desserts. I thought the dark chocolate mousse was the best thing ever. I always love cream brûlée though.", "date": "2016-02-02 02:13:18"}, {"review_id": "hP3NU_1oQT2CXaHFrSnhvA", "user_id": "uYfMsd6b78baED2giE_bHQ", "business_id": "-Fka99c-tJ-epWYNIobqyQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My family and I moved to the area several months ago and have been searching for a  great pizza place and have come up short until now.  Our neighbor suggested Pizza Mizza.  We gave it a shot last night and we are thrilled.  This place is much more then your run of the mill pizza joint.  The quality of the food and menu selection is outstanding.  My wife and I loved the fact we could order a great glass of wine and a cold beer while the kids enjoyed their dinners from the kids menu.  Love the patio and love the fact that they deliver.  We are definitely looking forward to our next visit!", "date": "2012-06-29 19:06:12"}, {"review_id": "QLxSrwg5POcoF3Ihd_6NpQ", "user_id": "PJBF-bqE7Qa35LsV1unUmA", "business_id": "ZiQiMlvgk19GrEEkN9kyRA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "The flat white was very good as was the pour over.  The hot chocolate we ordered for the girls was very late - in fact didn't even get made.  I'm not sure if the request wasn't heard by the cashier or just not entered.  Fun little place.", "date": "2016-06-12 22:02:09"}, {"review_id": "OE2VVcjDocmA7ltIvsDBlg", "user_id": "x9b48ST0PwIWrnluGsuu4w", "business_id": "Eqt-veWZaGVzInCr6zkNRQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "These gentlemen saved me!  I had bizarre issues with my car driving from the Bay to Reno. I was treated daily and not price gouged like other quotes I got that weekend.", "date": "2018-05-08 20:50:32"}, {"review_id": "R5mmCu_tPwsKAZgQpzUlXg", "user_id": "dsMUD8MI6HDrhJc29GCEcQ", "business_id": "3wogQmKw729tKKWaVbZvbg", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Don't eat here! Worse dining experience I had in NOLA. To begin with, they're severely understaffed. This resulted in not only a long wait to order and be served your food at their lil bar stools, but also the food was cold. I had the jambalaya, which tasted like it was straight out of a Zatarran's box, which is fine if you weren't paying $10 for it. My mom had the grilled shrimp poboy. Much to her dismay the shrimp was not grilled and it was not large shrimp, but rather small baby shrimp. We never got a refill on our diet coke nor were we given water. Whatever you do, don't waste your money here at this tourist trap. There are plenty of other eateries to experience local fare", "date": "2015-03-22 06:00:17"}, {"review_id": "B2dLhgG7kAAd_NrvUl8QOw", "user_id": "MN6vTCeRKWU44M7xwhQc7w", "business_id": "067InE1pMXlEXc1OgakKUA", "stars": 4.0, "useful": 5, "funny": 0, "cool": 3, "text": "Came here for a pair of hiking shoes for an upcoming trip to Yosemite (and for training in the meantime).\n\nThe two guys that helped me in the shoe department were absolutely awesome!\n\nI explained what I was doing (training to hike half dome) and they were able to guide me to several shoe options to try on.  Plus, they carry half sizes through women's size 11!  Not something I can find everywhere.  And, they have a railed rock where you can try the shoes two steps up and down steep terrain.  \n\nI tried on at least a half a dozen pairs of shoes and they never seemed the slightest bit impatient with me.  In fact, they were the complete opposite--happily helpful the entire time.\n\nI don't shop at REI frequently, but having a look around--I think that will change.  They have a pretty sweet women's clothing section with great workout and outdoor adventuring clothes.  Oh!  And, I scored a pretty sweet sun hat for all the training hikes (as well as the big day on half dome).  Awesome!\n\nGet to it!", "date": "2015-05-12 17:18:13"}, {"review_id": "nLZVV4dR_LZd_Uh1zTX8Cw", "user_id": "HsJlGxMuGfyjRGbf1Et1Ow", "business_id": "lPyDFWRGJkHkKZJsQ5Oz7g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My family has been a patient for the last 8 years and can not say enough about Dr. Aramini and his staff.  Stephanie is so nice and always willing to work with us on our crazy schedule.  I highly recommend them!", "date": "2014-10-13 21:04:40"}, {"review_id": "Ku-2X4loJTCFiipA_ktRNQ", "user_id": "yfpMOZOSUK9lQ9_6m0J9iw", "business_id": "pviSeQrnoQ7MGOGGcau3Xw", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "was visiting Media & went with my besties for pedis.  they do a great job-- salt scrub & hot stone leg/foot massage is included in the $25 pedi.  good selection of colors, they have those big crazy massage chairs & a bright, clean space.  all the ladies that worked there were friendly.", "date": "2012-04-29 16:59:05"}, {"review_id": "heBvCLkFS9Zwdw00gayARw", "user_id": "SaFs8ThfmEgdQm16iXoNqQ", "business_id": "2KIDQyTh-HzLxOUEDqtDBg", "stars": 4.0, "useful": 2, "funny": 2, "cool": 1, "text": "I used to corner up to the Espresso Bar every Friday in high school to watch my barista friends at Mazzaro's make their latte art. I don't drink coffee, but I definitely eat cookies from the counter directly next to the bar as my buddies fashioned dogs, the Eifel tower, and smiley faces from froth. My other favorite things to do at this café/market place are: look at the giant wheels of chesses, stare at the giant stuffed animal heads that move, eat meatball subs on the patio next to the bubbling fountain, sip on Italian soda, buy authentic Italian goods to fashion into gift baskets, buy meatloaf for dinner...and, of course, eat a lot of cookies.", "date": "2012-10-10 21:24:19"}, {"review_id": "cH_Np1Zq-T2F9WHrvMV_ng", "user_id": "v7-Wx7lJ_xtblPiLPJWQ5w", "business_id": "XvzK4xzpVPq2Tj5gPv1LlA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "The My6 App for the iPhone and Android is 100% bogus and does not guarantee the rate it quotes from the Motel 6 database. The rate does not include all the taxes which you have to pay. It is very misleading and underhanded. The Motel6 charges $3.99 extra which they don't tell you about on your smart phone. No wonder AirBnB is so successful.", "date": "2017-03-16 20:54:18"}, {"review_id": "nN3oRW25FfyHwC0e-NS49w", "user_id": "ECOnG7Fk_Ako78jEXXIhoA", "business_id": "bmz4siaejdjs4_yS_mYW4A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great service! The food was exceptional. You never know when you go into a strip mall what you're going to get. This place is awesome! Their black bean burger was drop the mic good! #vegananywhere!", "date": "2017-09-23 17:34:04"}, {"review_id": "t8g62BnxYZhoQ6XJIzq8KA", "user_id": "LL0e0oh62wFkSEMl6At87A", "business_id": "E1gf1YIWOo1BgzMUwJtEZg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "So P.O.'d...they were my 'go to' delivery place. Loved the traditional w/ half pepperoni//half artichoke. Tonight, I got a literally half-baked pie that was rocking the cold. You'd think that, after many orders, with @ least a 20% tip for the Driver...once in a flippin' while...he w/ be pleasant. Not.", "date": "2011-03-20 23:45:54"}, {"review_id": "7sx2njhbrlnQyUviJiCw0A", "user_id": "iS-tRPvKAHeSqV_D9XFl7g", "business_id": "8s1uT8dyBEUwTNeHoZntMg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Without a doubt the saltiest meal we've ever had in our lives...and that's for 2 dinners!  We had the enchiladas poblanos and a combination plate. Both, way too salty, and I like my salt but this was even too much. The salsa was ok, the chips very good.  The Sangria was good.  The Sopapilla was way too crispy almost to the point of being a chip.", "date": "2016-07-04 22:13:18"}, {"review_id": "5iJ9EA1F6fstKl9uwJb4HQ", "user_id": "kJcZOEjSMYihGHZyR1q8_Q", "business_id": "w520vYWEpEYBf90rSr9NVA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We went early - around 4:45. Not very crowded but it took at least 20 mins for our food to come out. That's ok. We ordered the pad Thai and lettuce wraps. Pad Thai was stellar; lettuce wraps were just ok. I think the prices are a little too high. Love the atmosphere in here, it's warm and there are lots of sweet little plants.", "date": "2017-01-28 23:45:32"}, {"review_id": "Wz5prgoKVbLbHxUL9qpsmQ", "user_id": "eNeD5YpRQtk7lTmai-WXDQ", "business_id": "KhBUg5QhBYuK8RZAe5gDMQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is relaxing place to rest your feet. It is an old gas station that has been converted into a cafe/brew pub. The beer itself is very good. The cafe had a limited menu, but the selections are unique. The Liberkase is a pressed pork sandwich. It looked like spam and was not something I would order again. However, the grilled cheese was very good. It had pears and gouda cheese grilled on marble rye. The salad it was served with was also tasty. The Ham and Brie cheese sandwich on a croissant was also very good. There is plenty of outdoor seating. Indoor seating is somewhat limited.", "date": "2018-01-01 22:36:03"}, {"review_id": "gUztdws0hYSNVqRBa4eLLw", "user_id": "_P-m6WYH0hRLMTXAOk1aUQ", "business_id": "M0r9lUn2gLFYgIwIfG8-bQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Loved this place. From the decor/atmosphere, drink options (at least 50 lemonade/milkshakes/iced tea w/liquor options, so many sodas, etc.), to the burgers my party got.  The food was fresh and yummy. I got the buffalo burger, but subbed bleu cheese for the cheddar and a side salad the dressing is super light and refreshing.  The rest of my party was more adventurous and got the PB&J and smoky burger.  The guys who got the PB&J said the jam was sweet and was very interesting (in a good way).  The patties themselves aren't out of control like so many restaurants are nowadays.  Four of us split a large fries and left not feeling overly stuffed. Will definetly be back if in the area again.", "date": "2013-03-19 23:37:23"}, {"review_id": "F4Hmph871Hu2QyhpJs8gsw", "user_id": "NTe9hwqjHZQFY0FAROZkgQ", "business_id": "oQ5CPRt0R3AzFvcjNOqB1w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "No joke: the best nachos and best wings I have ever had. I will go into detail: \nAtmosphere; super chill. I am from Florida and wanted to find a local spot, not something touristy and cheap. It was very chill. I love the show \"Nashville\" on abc and I thought I would see Gunner or Scarlet or Deacon walk through at any moment. Besides being ear the cute restored east Nashville homes, it felt casual, comfortable and like I was supposed to be there. \nThe nachos were a delicious and ferocious gift to my soul. They were on homemade potato chips, not tortilla chips, and the brisket was melt-in-your-mouth good. The barbecue sauce and cheese and sour cream and everything were so delicious.  \nThe wings had a flavor that Florida doesn't even know about. They were unique and smoked and hot and welcomed to my appetite! Lastly, the Mac and cheese, it was good and flavorful, but absolutely overshadowed by the nachos and wings. I will be back, with my husband and a smile!", "date": "2015-11-08 03:12:48"}, {"review_id": "7cNAtYJW3gfS1ZdIfKaHpg", "user_id": "fw94lNhwRxeklb2ZKAFe2w", "business_id": "pP1V9AvK716BMxoHkNVWdw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Last night, Yelp had an event that paired mini cupcakes from Batch with a few beers from their neighbor SixFour Growlers.  The cupcakes were delicious!  The flavor combinations were very good and I don't know if it was the addition of beer in the cupcakes, but they were moist and very flavorful.  This is just one of the many things I love about Yelp events, the chance to try something new or a chance to rethink a place you may have not enjoyed the first time.", "date": "2015-07-29 15:37:38"}, {"review_id": "aUz1-Znx7jUlOG_LSQmDKw", "user_id": "wfOUKbaunZPt5MZA9x9yVQ", "business_id": "xr6tLZ6MMyBmOr8EGVAWQw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I don't normally frequent 7elevens but being a few blocks from my house, we have grown fond of this store. Nice staff, quick service and quite a bit of selection. It is always packed for a reason!", "date": "2015-10-25 01:23:39"}, {"review_id": "_OsVo-NzeiSRraiijBH7mg", "user_id": "tBSf7OFMvbFJrUS-heWLyg", "business_id": "PY9GRfzr4nTZeINf346QOw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ok where to begin. This was my first trip to Reno as an adult. We pull up to Peppermill and it looked awesome. The valet was very nice and took all our bags. Its was a girls weekend (over-packing as per usu) and even took my board game. (I said over-packing). We walk it and its buzzing, I start feeling happy and giddy ready to have some fun with my gals. We go to check in and the gentleman there was awesome! I cant remember his name but he was employee of the year for 2012 and I can see why! So after checking in, we wander around for awhile then got to our room. Totally awesome. Great room we had a view of the pool and since it was a smoking room the windows opened! So that was the one benefit of the smoking room. Now here is where it all goes down hill. The service staff here is the worst. Except for the server at the 24 hour restaurant and our server at the steak house (i think his name was Franz). Other then that they all were horrible. Getting drinks at the bar, you would think i asked them to make 30 long islands not 2 grey hounds. And I have bar tended, so don't look at me crazy when you don't get tipped, because at this point I gave up on giving tips for shitty service. The pool service was a joke and every single staff member was completely rude. I get it you are in the heat and have to deal with people but its called fake it. I work with clients and vendors and would never act as these people had. We were told that all the cabanas were sold out and since we watched them all day, no one and I mean no one went into them at all, they were empty practically all weekend.  We went back to our hotel room and decided to play a game and guess what they never gave me the game. I called they didn't have and said to keep calling and they may find it. So i just chalked it up to the game gods and said wtf. Game was never found. As we went to our dinner the men who are at the bouncers at the club asked for our Id's (very rudely) and I asked all this for dinner (thinking maybe its a dinner club and they have a age appropriate  show) and he tells me nothing as we walk to the hostess the bouncer yells you guys aren't going to the club and at this point I'm so annoyed I yell back something like \"its 7:30 i don't know who goes to a club this early but its not us.\" Dinner was wonderful and the food was good in the 24 hour place as well. But that's about it. I did have fun but only because I was with my friends. I can sadly say I was not impressed with the staff (even the bell hop was standoffish when he came to get our bags) and that made a huge impact. I was glad I had got a packet that had this room deal because had i paid full price I would have been livid. And one last thing. I tried to book another room visit prior to this visit because it expires in September and was told that they had no more rooms for this package. So i am now out 50.00 bucks for something that I can not use. Pretty shitty deal if I say so myself. (and i tried booking it in May)", "date": "2013-08-16 18:40:52"}, {"review_id": "cwz9L1xC5V_XgfHSkHOxig", "user_id": "AbOaXoif__VIBGEvNKXONQ", "business_id": "cXAKeC-EgVChIxhS7fscmw", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "Was really disappointed when I received my tofu Provençale this last time.  Both the potatoes and tofu came out incredibly dry...no olive oil to be found on the plate.  Their Provençale had previously been a blend of olive oil, herbs, tomatoes and garlic sautéed to perfection.  I've always asked for this dish without onions.  Today the olive oil with Herbs de Provence, garlic etc. was completely missing.  The waitress told me she had no idea why they did that.  It was just dry fried tofu with a bit of tomato and herbs. I was so disappointed that this excellent dish had been botched.  She took it back and returned with what tasted like a lesser olive oil and nearly raw garlic added to my existing plate.  I guess I won't be returning, which is too bad because I adored that dish.", "date": "2015-03-06 18:59:24"}, {"review_id": "MDMs5ntydkH9P6NT80fnIg", "user_id": "d4u8qcUX_tSchYWNv3HeXA", "business_id": "4SneIG3-02kRCgQx-hu51Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Strong! Much nicer, and much better food, than your typical \"casual\" steakhouse.  Not the same quality as the big boys like Fleming's or Ruth's Chris, but J.B. Dawson's is much more affordable. Glad I discovered this - it's in the rotation now.", "date": "2017-10-26 15:23:23"}, {"review_id": "vHauFg0RnZd3H897XpLV7Q", "user_id": "Cq5m2QxUu-5w-sJq_4Hz2w", "business_id": "T2otvNcawDSkhykOG2tOLA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very hit or miss. Sometimes you get a good waiter who is nice, polite and gets everything right or replaces it immidiately.  Sometimes you get a terrible waiter who is rude, doesnt want to help and doesnt do his job properly.\nIn any case the food is decent and the two managers I have spoken to are rude and unhelpful.\nIf you want my opinion the one downtown is much better.", "date": "2015-03-06 22:40:27"}, {"review_id": "iYuoIDtFBDCvYwNtaYQExg", "user_id": "mETm3tqzpLOA132lC5t41Q", "business_id": "S2Ho8yLxhKAa26pBAm6rxA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Creole House, you are on my list of MUST RETURN when in NOLA.\n\nAppetizers:\nCrawfish Cakes: DELICIOUS. Whatever that sauce was, it was asking to be licked off of the plate.\n\nBacon Garlic Oysters: MY GAWD. These things are addicting. I had to stop myself from ordering more. They were FRESHLY chargrilled, like you couldn't just pick them up off the plate. They were literally piping hot and ridiculously amazing.\n\nEntrees:\nTaste of the Bayou (Crawfish Etouffee/Red Beans & Rice/Jambalaya): All were VERY good, but the star of this plate was the Etouffee. The flavors blended so well, and the seasoning was spot on. no hot sauce needed. The jambalaya needed a few drops, but it was good as well. Red Beans, better than anything in California.\n\nShrimp and Grits: I NEVER finish plates at restaurants (I am the to go box queen) but this plate? I scraped it clean. The gouda grits were decedent, rich, flavorful. The shrimp were fresh and plentiful. The cherry tomatoes were the perfect garnish. I was completely blown away by the complexity of the flavors. \n\nOh, and by the way, the service was great. They were busy but the server was very friendly, and kept up with us.\n\nPlaces like this are the reason I could NOT live in NOLA, I'd be obese and broke. See you next time Creole House!!!!", "date": "2018-07-10 03:26:00"}, {"review_id": "uYEFWAsIAwZZsKBSxVIEYg", "user_id": "zBsunykLcYHx47x525FPmg", "business_id": "J6MGQigHItdSlG-3XZ1myA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice, relaxing place with a home-y feel. Having the table-top BBQ was awesome, food was great", "date": "2016-03-10 20:45:23"}, {"review_id": "-WxQLxZphINFHUHwZPnwJg", "user_id": "sjwAN8-7N_iVLiEVVjc4iQ", "business_id": "eaDZlSuVS0EY67Ke6pRP6Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome Indian cakes. Had to try them. Staff was chill & fun. Waiter explained the items we asked about very well. My dish was tasty even with the anchovies :)", "date": "2015-11-20 10:55:17"}, {"review_id": "jg8FWMg6Nupbe5fskpOAcg", "user_id": "XDuwxkQbm4Nux-pQf861GQ", "business_id": "yMXgFFx-KjmT_QItAuk_Ew", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I found Bobbin Ventures through Yelp. Jayna, the business owner and a fellow UCSB Alumni, is a pleasure to work with and has a gift for tailoring. She shows great attention to detail and tailored my suit exactly to my liking. I will be using her services in the future.\n\nThanks again Jayna!", "date": "2013-03-21 17:32:57"}, {"review_id": "aRd0W7WqW5OaJ8KuKC-TNw", "user_id": "Tstba9yvh6a_hNzbC5ZlQg", "business_id": "UQssxfQY7LcLEtagk9ecog", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered takeout from Aroma,  and I was extremely surprised at how fresh everything was.  I'm not well versed in Indian cuisine,  but I know what I like.  :)", "date": "2017-06-30 16:59:33"}, {"review_id": "qNfAGxTn0xNu1kMjmXpI3w", "user_id": "o0JRacmlW4dxx-Xc2UP_Kg", "business_id": "qgott66PgfZhxt9fpstGiA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food is amazing especially the Hummus. The only reason I didn't give a 5 star rating was because the service was a little slow. I went on a Saturday night so it was pretty busy. They are very nice but maybe could use more help on busy nights.", "date": "2016-01-31 02:16:42"}, {"review_id": "O-KayL-F8pn_03ML0C4Htw", "user_id": "6i3Yh-4PMc_FD18UVIVoSQ", "business_id": "9HWMKDCWFF2sH-wfO3XGcw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "These guys are the best! I have been a client since 1998! The spring on my door broke and left me unable to open the door. My car was trapped! I called them at 5:00 p.m., and they were at my home bright and early the next day. Super-quick service much appreciated!Their tech, Brandon, is just as nice as can be. A pleasure to do business with! Thanks!", "date": "2017-11-08 16:03:35"}, {"review_id": "45fStnMtkw5o4r_TQnJuig", "user_id": "vo2GzuR6kOFL8wGEpJYS3g", "business_id": "7yPzOek7Af2dKWGYKpcHWA", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "Family owned and operated - Delicious, authentic Cambodian Southeast Asian food, homemade and freshly prepared. They take care to provide quality ingredients - even going as far as providing water in carafes that is from bottled jugs, not Philly tap! \nI highly recommend it for Asian food lovers that are looking for a whole new flavor profile - crosses over with some Thai & Vietnamese flavors, but completely unique and bursting with its own unique flavors, rich with culture!\nI highly recommend the Cha K'rung (lemongrass beef) & Prah Hok Kateeh (sweet caramelized ground pork with fresh veggies).", "date": "2017-08-09 23:26:17"}, {"review_id": "-C5ySRacKsliKA3Dzu3nNQ", "user_id": "Icoqtxs4WZGdWYxhkSjovQ", "business_id": "ro3mmznC6MEhzEw4osI-ww", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "It's was 6:40PM and they had the doors locked to the dining room. We awkwardly made eye contact with the employees inside working... then two little kids came and opened the door. The employees didn't attended to us at all and pushed us off and made us wait (nobody was in the drive thru). Of course shake machine was down; like anywhere else around here. We just got two tacos and left.", "date": "2018-01-13 00:54:32"}, {"review_id": "vHbIWO5nse5W6dOCGFy8Hw", "user_id": "W625SoCsKsZyiws3GR1MTg", "business_id": "_3VCzu9a79nrU0YA-WvUCg", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Typical McDonald's.\n\nOpen late - and thats a win when you need a burger at 1 am.", "date": "2011-07-03 18:16:15"}, {"review_id": "LZm_n-i8rNjq7vBWNmKuGA", "user_id": "zV6otO9d60bPLCqMlco5hw", "business_id": "WaRZsQEcEHwRk0T2dJ-cuA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Thank goodness for yelp because we would've never found this place without it. It's a little hole in the wall place very charming. We happened to come on happy hour which was a great bargain we had two drinks and dinner for a little over $20 Great guacamole and simple tacos were just what we needed. Shinon the bartender was helpful and accommodating.", "date": "2015-02-24 23:40:34"}, {"review_id": "4vRfkS_5gd3R3bhyahswew", "user_id": "LNeUIkubMxRZxvOmzzg2tg", "business_id": "TTl2V6mG7IAMi_JK16bgow", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was more than a little hesitant to try Teavana after reading reviews of pushy salespeople. But praise be to Yelp- they must've learned their lesson because I was here two days in a row with two completely different staff and while there was a lot of explaining/demoing there was no pressure. In fact today a wonderful salesperson dissuaded me from buying the overly expensive starter kit and rather get me a tea I liked,  a tin, & tumbler on sale! (Please note this starter setup was HALF the cost of the actual kit)\n\nI was thoroughly impressed with the staff who were able to guess exactly which tea I wanted after I blankly starred at them and said \"I dunno I think it's green tea based with fruit...\" Even more impressive was the reassurance that you will know if you will like the tea simply by smell, I didn't believe it but totally true.\n\nCool note: Teavana was purchased by Starbucks last year so those Starbucks gift cards work here and if you have a registered card you can accrue stars here as well!", "date": "2013-12-30 21:33:20"}, {"review_id": "qP0lkVGZknW1Xy8Hak5ZRw", "user_id": "1fXS4UoB6VPPPiKISWb6uQ", "business_id": "Fbq_tc6W5uNmQNrInXpd5w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love getting salads here!  They're reasonably priced, yummy and are a convenient carry out.  The salads are fresher and cheaper than most other places in the category (I'm looking at you, Bread Co).\n\nI have always had speedy and friendly service here, whether I dine in or carry out.  They sometimes host local author talks and book signings, which I really think is an awesome way to build a community feeling.\n\n\nI HIGHLY recommend 6 North Cafe or a quick lunch, a place to grab a bite while working or studying or a for carry out.  Essentially, try this place!", "date": "2012-10-12 04:29:58"}, {"review_id": "_yLw_SVB4EkNlKFLyCNTxA", "user_id": "6WG2IGTVr-xKn0pYQZJGjw", "business_id": "1DkolDhbc0kydORZCIp7Fw", "stars": 3.0, "useful": 9, "funny": 1, "cool": 7, "text": "Lots of potential here, but a lack of preparation for the insane crowds that came out meant many folks went away hungry.  \n\nThis event -- which I heartily hope will return to East Passyunk again in a more robust form, with lots and lots more vendors -- was just a victim of its own outsized buzz.  Bloggers, the Twitterati and every hungry hipster in the vicinity came out, with their dogs and babies.  I laughed out loud when I saw the line for tacos -- you can walk two blocks in any direction from Passyunk & Tasker and get 3 for $5.  \n\nHopefully the Food Trust learned they need to scale this event up if they actually want to feed anyone. The interest is certainly there!", "date": "2010-10-08 14:35:25"}, {"review_id": "FKf5Z2PPHQFKCeavtOE16w", "user_id": "68OFdA9IeSozY-9M-0JfPw", "business_id": "nX2105_S9lUhB5rbhC2n2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This places, hands down, had the best simple donuts. There is nothing fancy or unique about them, but if you're looking for some just good classic donuts this is the place to go.", "date": "2017-06-07 18:49:19"}, {"review_id": "jUzbkYKLep6tAiFMJRz5og", "user_id": "V-Tv_2hv1Ag3wQrqOpVnEQ", "business_id": "3lBooCffgkW7tVSG5kILBA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Went here last night, we weren't able to sit for 45 minutes after our reservation. Luckily it wasn't freezing because we had to stand outside the restaurant because it is so small. So be advised this is not a place where you will sit at your reservation time. It's more of a longer dinner. \n\nAlthough there was a hug wait the food was really good. The waitstaff was nice and let us have a long meal and open plenty bottles of wine. The cypress salad was amazing I had the fetticini bolognese which was also fantastic. The pasta was so light I was able to eat my whole plate! The olive oil they give you to start with has cheese in it it is delicious. My friend had a special with squid ink pasta and crab claws. It was also really good. I highly recommend it for the food if you have the time for a longer dinner.", "date": "2015-01-03 22:31:41"}, {"review_id": "iiU7gvxaJXVrUs7PBsE1yg", "user_id": "HHvm5OJjy6Etp9lFAbyMBA", "business_id": "NL-pATcAaXHwxrm7ODwEig", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I'll probably give any Village Inn 5 stars! I love them as a breakfast place since they have great skillets, but their French silk pie is really the 5 star winner here. I can't find one that tastes like it anywhere else. \n\nI wish they would open Village Inns in south Florida!! I think they would do well, especially since they have they have the best pies!!!", "date": "2013-11-18 04:19:54"}, {"review_id": "7gBRi-1KfYhtxrr5mpMM0g", "user_id": "lR-djrUDXWe2Ht_tJhMpUA", "business_id": "QExWORi8kxwQGdXlFXRc-Q", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "Stopped in at 7pm on a Sunday night for some homecookin food.  Saw a sign for $1 drafts and .25 wings.  Place as less than half full but the 2 girls waiting couldn't keep up.  Even sat at the counter in hopes of better service.  Finally got my hands on $1 beer - was flat bud light in a red solo cup about 3/4 full with 1/4 head.  Was also told in passing that they were out of wings so there went that idea.   The waitress never made it back to me for my order and no one else acknowledged me so left money for undrinken beer then walked out.  No one seemed to notice.  Very disappointed in this place.", "date": "2016-07-18 00:01:40"}, {"review_id": "xqXjiE-KRUGx-8o5Pjh4LQ", "user_id": "wTd_Ug03R787dbCJcy5cEw", "business_id": "KXQ7xJTGknQAL0u5ot2NPg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent customer service, and very personable. If you need or want Lucchese boots, Nashville is THE location to go through. The store manager, Joe W. is hands down, the best. I am a Lucchese client for life thanks to his services.", "date": "2017-03-17 14:56:20"}, {"review_id": "jw1BDavRDHtbXnYpcFuuJg", "user_id": "2hBR10VOgQgHZKeuAPwwdA", "business_id": "oQ5CPRt0R3AzFvcjNOqB1w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We ate here last night during the 6:00 pm rush. We shared an order of fried pickles and I had the pork tacos. The fried pickles were decent and the tacos were excellent! Good flavor and great texture. I'll definitely be having those again! Don't bother deciding on your sides until you get up to the counter and can see the board because they do not have everything on the menu every day. The mac and cheese was so good! It wasn't what I expected from a BBQ place! The \"baked beans\" we're also good but they are really mixed beans and not at all like the BBQ baked beans you get at other places. Still good, just not baked. \nThey also had Abita Strawberry and the Blackforest Kolsch. Excellent bar selection!!\nI'm docking them a star because of the system of ordering at the counter and then taking the plastic number to a table. This system works in theory, and in practice at other places, but you HAVE to keep people from \"saving tables\" when they have yet to order. I get it if you have a group of 10 but for normal sized tables, it throws the whole system off! The line was long last night but the food comes out fast so tables turn over quickly. By the time we ordered there were no open tables. There were around 8 tables taken up by people who were still 20 minutes from ordering. That throws the whole system off! Let people who have already ordered eat. Another table will open up for you by the time you order!\nThis can easily be solved by posting a sign and asking the servers to enforce it. \nLuckily there were two spots open at the bar. \nOn a side note, the bartender was awesome: fast, attentive, and knowledgeable. I may just sit there in the first place next time!", "date": "2014-08-10 23:15:15"}, {"review_id": "Pv33hzmaYTzn-cUpjwFTjA", "user_id": "Un2Dx_SoTlKJ2fJtNUulCg", "business_id": "TV81bpCQ6p6o4Hau5hk-zw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty solid tourist trap type restaurant on the docks. A little bit overpriced for the food quality, but reasonable given the touristy surroundings.", "date": "2015-11-07 21:40:37"}, {"review_id": "lBMli1VNHCxWwFTTnHX_NQ", "user_id": "3GJURXdablhLFRo_qz6mrw", "business_id": "AvOOcxJJgcz7VtCazDMaLA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Philana is the best!\n\nI have had my hair both cut and colored by her and I have always been very happy with the results. I was immediately taken in by her vibrant and bubbly personality. She was very warm and did a thorough consultation before starting each service, and I felt secure that we were both on the same page. \n\nPhilana's attention to detail makes it obvious that she is a professional and has been doing this for a long time. My hair looked and felt great and I would absolutely go back to her again. If you want your hair done by someone with experience and expertise, go see Philana!", "date": "2018-04-06 04:06:24"}, {"review_id": "-cHtqHUY02Wq3GfA-WQ2tg", "user_id": "gXa1HYlzq63Y3AF8X2Qj0w", "business_id": "eaV07HGOcyb27XobHVl8LQ", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I went in for a mani and pedi. My student was a nice person and we chatted. However it took 3 hours and my hands just look terrible. The feet are fine and feel great. Hands, just terrible. No one came and checked in if the work was done properly. I'm fine that it takes longer, they are there to learn. However, I shouldn't have been charged for the manicure (pedicure yes) or at least have someone else redo my nails. See the pictures for yourselves, this is 15 minutes out!\n\nEdit: just wanted to add that when I removed my shoes, my pedi was ruined. I asked if it was ready to put shoes on and I was told yes. 2 stars only because at least my student was nice but 0 for the service (34$!)", "date": "2017-01-27 20:42:36"}, {"review_id": "bjANpM8LYMNNEsZxjPlvHg", "user_id": "x52p89JRZtOqlf2VCvrmBw", "business_id": "JgTSG4rIDf20Kgp6U_asng", "stars": 4.0, "useful": 9, "funny": 4, "cool": 4, "text": "In a semi sketchy neighborhood: check \nBar looks fairly hole in the wall: check\nThe seating is nearly impossible to get on a weekend evening: check\nYou shouldn't order anything but beer: check\n\nSeriously folks, don't be like the people I saw here and order a Chardonnay with your dinner...because it'll come from a mini bottle on a never dusted shelf of their never touched drink area. It's like the stuff you might get on an airplane. However, who in their right mind comes to black thorn for Chardonnay anyway??? It's all about the beer here.\n\nI know this place seems sketch...they do not even have a menu online. Oh noes, what will I do? Well if you have a hankering for Chicago style deep  dish pizza and you want to know what they offer you seriously need to call them or look at the yelp pics of the menu. If they give you sas, well I'd say that's expected of a grungy place, but that's not necessarily true. I really didn't get a good feel for their attitude here. \n\nWhen I was there it took forever to get a drink because of how \"busy\" it was, but like I said it was mostly expected. It's tiny and a bit rundown feeling like a dive bar. Not my favorite feeling but that's part of why they don't get 5 stars from me.\n\nIf it's busy you probably won't find seating immediately. The best solution is to scope things out and play some arcade games until something opens up! \n\nThe pizza here is seriously an awesome combo while you are drinking. I love deep dish, and while black thorn isn't my all time favorite, it's pretty good for st Louis. \n\nKeep in mind deep dish takes forever to cook and when you are in line for your pizza to be made it could take an hour, which means you might already be feeling the buzz of your alcohol kick in.", "date": "2012-09-11 02:46:01"}, {"review_id": "fWZVkadgW5u8gA89kFHg1w", "user_id": "A08Z4MwB5tD69Uxpq0vZqg", "business_id": "iJKOUYgigs4VYsWny6AtEA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Excellent thin crust pizza.  Not much seating inside and that is why I am rating it 4 stars instead of 5.  Pricing was very affordable and their is a good selection of items on the menu.  Highly recommended and will be back.", "date": "2015-08-07 21:09:40"}, {"review_id": "dYT1_ktY8Ql3p6smAURwsA", "user_id": "qYIHRwuu4h1d_3QmM_3Vdg", "business_id": "RuuGJoMm2Y3wbLbPPHTvqw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The place has the best Chicken Cutlet Parmigiana I have ever had. For 8.50 served with fries, soup, and slaw.", "date": "2012-10-16 13:45:01"}, {"review_id": "00Eo0N7gTYQ7XKCCFra6Kg", "user_id": "IJJETLhfEVvuUF_UfA7Hug", "business_id": "jh8hrTl_k99mP05rrvczpw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Bought a pair of boots and needed to return because I found a cuter less expensive paid at Nine West outlet. When I returned the cashier would not let me keep my original receipt she would only give me back the return receipt. I do not like this policy because I have to reconcile my credit card statement and not having that receipt makes it impossible. She balked when I said I needed to at least take a pic of it.  Doubt I'll go back.", "date": "2017-08-28 20:20:09"}, {"review_id": "ontSgGJtGitgIu5lDxd4nw", "user_id": "Xw7ZjaGfr0WNVt6s_5KZfA", "business_id": "rGY1uR4mt9hB8wYY_er-Uw", "stars": 5.0, "useful": 8, "funny": 6, "cool": 8, "text": "Since it's Spring, I decided to get the yard together. I recently had to have some plants pulled out of the yard because they died, so I was in the market for some new tree-like shrubs to take their place. I had a specific type I was looking for and after calling around to a few different places, Bantings had what I needed.\n\nThe process here couldn't have been easier. After I called them, I went over there and they showed me exactly what I was looking for. After helping me pick out the better looking plants of the bunch, they loaded them onto their truck, I checked out, they loaded them into my car and I was on my way.\n\nBantings is HUGE and probably has any type of plant you could ever want. They even have veggies and herbs, in case you want to start you own garden. All of the plants look very healthy and well cared for and I saw multiple people on \"water duty\" on the day that I was here. Fast service and a wide selection will have me returning to Bantings in the future.", "date": "2017-05-26 19:20:58"}, {"review_id": "q-mkpSDaixfmOCX_SmM6SA", "user_id": "IYV6NI4HS3sqCssQJwoLag", "business_id": "UaVoW-gAYlvowgeF5Pc1Nw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Costello & Mains were my saving grace! I was going through such hard time, not only did they protect me legally, but they were there for me as a friend, someone who really cared. They constantly stayed in touch with me which was huge because I had no one else to turn to and they were constantly there. I would definitely recommend them to anyone who is having any legal issues.", "date": "2016-08-26 03:12:55"}, {"review_id": "wLznWnbROpOCqTDJd2ZUbg", "user_id": "z7QheenbuQM629tKuUZfMg", "business_id": "zXgSqLVumgxM_e5OgWfUTw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Was back in town for a visit, stopped by this cool bar.  It was awesome playing some retro old school video games, and the beer choices were outstanding.  I loved the local brews on tap!  (And those that know me, know I love my beer)\n\nI would recommend this place to anyone!", "date": "2017-11-22 20:41:54"}, {"review_id": "7_tDyF2O5xfhBdXLXsX1pA", "user_id": "y3zRKRF2uJYoOYe-_j9siA", "business_id": "2bl6G1zgXUHbMGwEocqMSg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love me some Dave's dogs !! I want some rn ! I love Dave and his cooks and workers all so sweet and amAzing ! They on point and the food just is so ridiculously delicious! You will keep comming back for more ! I love them all try everything!! And keep trying them they all\nSo good and just different ' I didn't even like hot dogs till I went to Dave's dogs ' try combining dogs too my favorites are taco dog and Alfredo dog so dank !", "date": "2018-04-06 12:27:21"}, {"review_id": "pbXbIoZwe6cEihaYqbkSHw", "user_id": "kuhYz6erOHGKazHex8_KCQ", "business_id": "zwTmOj4B_OVPMTMYijQiKg", "stars": 3.0, "useful": 2, "funny": 0, "cool": 2, "text": "It was a pretty cute little restaurant; the atmosphere was definitely \"neighborhood pub.\"  We had a very nice (very obviously not Ethiopian) waitress with multiple visible piercings.  She was (*gasp* ) very attentive for an Ethiopian restaurant waitress.  The service was not as good quick as the average non-Ethiopian restaurant, but it definitely blew all the Ethiopian restaurant services away with the speed!  Gee, I wonder if it could be because she's not Ethiopian?!?!?!  hahaha  However, she did mention that she grew up in West Philly eating Ethiopian food.  mmmm I'm jealous!  \n\nAs is my custom, I went to use the bathroom and wash my hands before the meal.  Considering that Ethiopian food is eaten with one's hands, I would highly recommend this practice to all my friends .  There were two \"stalls\" in the bathroom.  Both stalls have saloon styled doors (2 halves swinging freely in the middled, hinged on either side).  The first one was lit, but the right half of the door was missing.  Given this, I opted for the second stall.  After stepping inside, I noticed a good 2 inches between the halves of the door.  Needless to say, I did my business in a hurry all the while praying that no one else would come in.  PLEASE LADIES, GO TO THE BATHROOM BEFORE EATING AT THIS RESTAURANT.  It is a harrowing experience!\n\nWhen the food came (sooner than expected), the portions were fairly generous.  When I bit into the injera at the Queen of Sheba, I was pleasantly surprised.  It was fairly sour!  It was not as sour as Abyssinia's injera, but definitely a few steps more sour than anywhere else I have tried up to date.  Now, I'm not saying ideal injera should be sour, but I like mine that way.   hahaha  Unfortunately parts of the injera were a little dried.  *sigh*   It's a toss up for me between dried injera versus more sour injera.   \n\nThe dishes were all decent, but not amazing.  My companion liked the potatoes in the carrot, string bean, potato dish.  I thought their salad was fabulous - fresh and dressed perfectly.  I did not care for the raw onions, but have to admit the taste was a nice contrast to the other dishes.  Both lentil dishes were decent, as I have said before it is difficult for me to tell much of a difference in them.  However, my trusty sidekick noted that the lentils were more watery at Kaffa Crossing.  I know that 1 of the lentil dishes was too spicy for me, but I am a big, Big wuss when it comes to spices, so that is neither here nor there.   The lamb was a big disappointment, it was a little sour (bad?).  The collard greens were pretty standard, nothing amazing.", "date": "2009-08-04 04:37:43"}, {"review_id": "85k5mcsXXAwXJOEYIVi7vg", "user_id": "SxbuVY2Vq9yvCJ6UmSj9ZA", "business_id": "SKW1zA4nY_SPKkQPmXNHoA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Saw the rave reviews and thought would give it a shot. The pizza we ordered (classic) was good but not great. It was the hand tossed -- the dough, sauce, cheese and toppings were good, but a bit too much bread vs other things. The price was way too high considering the size and product. The service was exceptional- we had our pie delivered in only 20 minutes and people were very friendly.  We may try again but since we are new to the area will likely try others first.", "date": "2017-01-17 01:49:40"}, {"review_id": "rA_r4yCRYl1w7aMD_iDJ4A", "user_id": "1z4ORXFXfj0q4Ics_oEv7Q", "business_id": "bqmX882_6AxVA_uHEQ70sQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Visiting and exploring Philly with our son who will be attending Drexel in the fall. We will definitely eat here again. The soup filled dumplings are a special treat. The Generals Chicken was beautifully prepared and delicious. The beef with broccoli was great-  the meat was very tender and the flavors were all very good. \n\nThe service was also very good, attentive without hovering. The prices are very reasonable and it was pleasantly quiet. Looking forward to returning.", "date": "2017-06-17 23:44:11"}, {"review_id": "IpwNjqI7SRzYiIxKj-CkfQ", "user_id": "_FQ4wA_9QbE5qzqzhVCpkA", "business_id": "AaWmckcT3O1iQSAIUmzwUA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was searching for my snobby Third Wave coffee in Clearwater Beach. I did not find it here. Nevertheless, the coffee is spot on with local flavor.\n\nSet your expectations--when vacationing in this area, you have three main flavors of food. Seafood shack stuff, Cuban style, and Latin food.  \n\nBasimo is a simple coffee shop with a modest menu. I got a cafe con leche, prepared in a Latin style (sweetened). I am not partial to sweetened coffee drinks but this was a good rendition.\n\nWe also ordered food--simple but we'll executed and health-ish. My wife got the yogurt parfait, loaded with granola, and I got silver dollar pancakes with cheesy eggs. Both hit the spot for a nice breakfast with coffee.\n\nI dock a star because I'd love to see them step up to be a pourover or at least French Press shop (they are fair trade and organic, so why not coax those flavors out).  The guy on duty mentioned he heard his manager mention something about pourover, which is promising.\n\nThe other nit is that the prices are way high--$3.50-4 for regular brewed coffee, more for espresso drinks. Get used to it if you are on vacation here. Still worth it relative to the area.\n\nClosest true craft coffee shop is in Dunedin, and I'm not driving 15-20 for coffee when I have a young baby with me on vacation. All in all, Basimo is a very solid shop with potential to be great.", "date": "2017-07-23 13:35:07"}, {"review_id": "ed7BfRAMowBE4GFfR0KjvQ", "user_id": "UQ0ZTdY3dHuY8s23bEr1XA", "business_id": "7qaewBVVl0lOfZPTvtR53w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Called to make an appointment and the women who answered was very friendly. From the moment my friend and I walked in, everyone was friendly and efficient. They did a great job and were accommodating. They made sure water temperature was fine and the chairs were comfortable. Everything was clean and the background music was nice. $65 for gel manicure and regular pedicure. I will definitely be going back. Best experience I've had in SB.", "date": "2016-01-04 23:06:10"}, {"review_id": "lRpMMHbjNaWSWTTlVb5Q1g", "user_id": "R-WSKg7NjGyBwIjN4q47xQ", "business_id": "mmBwAe9q062vKWanRfoagQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Rebecca was really cute and a lot of fun. She's doing graduate work in history and really knows her stuff. Love a free walking tour and I tip pretty well.", "date": "2012-06-01 22:24:20"}, {"review_id": "42LwQI8Hjec8gN234icn3Q", "user_id": "uw2lh91M5__yZdBoeFkiQg", "business_id": "UCMSWPqzXjd7QHq7v8PJjQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing food!! The servers were attentive and the food came out fast. Definitely recommend. We tried the S'mores French toast, grilled cheese (a must have!!!!) and the \"all hail the omelette.\" I tried the mimosa with blueberries (not sure of the name), but so good!", "date": "2017-02-15 20:48:44"}, {"review_id": "OGFYU75BJhiQsf62BeDL_A", "user_id": "0sdZ-MsGNCk8IgMKu1f2TA", "business_id": "g04aAvgol7IW8buqSbT4xA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was attracted by the reviews which were enticing. The service was deficient by delivering the order by piecemeal and lukewarm food. Wrong choice.", "date": "2018-08-26 17:03:50"}, {"review_id": "SXDJd3Fb5F4-bYZ_GQcOpg", "user_id": "6eXpHzfFCEnRvelmTqs7ng", "business_id": "AfOovhtD296J_Gi3GJ_hdw", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "Great shop! They have a lot of Specialized bikes at good prices--women's Vita was around $400. Definitely check them out if you are looking for a new bike. \n\nThe guys are super friendly. The staff always offers to help when you walk in. I was looking for a rear rack basket (incredibly hard to find) and they had one style in stock. It wouldn't fit over my Topeak rack so the guy back in the mechanics shop cut away some of the springs so that it would fit over it, free of charge. I love that they are super accommodating and want to make sure everything works for you.", "date": "2012-12-11 16:04:09"}, {"review_id": "d9j7KC7FTOkoI_L-iPIsDg", "user_id": "E-2aaJTr0Lup35NGhV5k8A", "business_id": "yQhu3LbnB2gQgrquHZ_S6Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The owner of this location (and two others including Southampton) reached out to me after my previous review. We ended up talking for half an hour and I was very impressed with his approach to business... he's definitely the type of person I want to do business with. I returned to Saladworks on two separate occasions and the service had vastly improved. The new summer salads are wonderful!", "date": "2017-07-08 18:38:29"}, {"review_id": "E-UBjHC37x4AKKZoEVkx3A", "user_id": "CK-W4WhlmLKOZF-50WmmpQ", "business_id": "knA3b_WnHUJAyrIzzL9Lrg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "I don't know why this place has such a low rating. The one in Vegas has 4.5 stars after nearly 1500 reviews!!\n\nMy friends kept RAVING to me about Earl of Sandwich (Vegas location) and I didn't really get what the hype was over a sandwich, so I never made much of an effort to go. I saw the EoS at Downtown Disney earlier in the day, but after a big breakfast and a Ghiradelli sundae, I just didn't have the room. The gods must have been smiling on me because then we happened upon EoS in Tampa! I could tell my mom wasn't that excited about it and was just indulging me by coming here, but after 1 bite she could not stop talking about how great it is. \n\nWe split the club and the holiday special which was like Thanksgiving on a rectangular bun. It was filled with turkey, stuffing, gravy and cranberry and was as hefty as a brick, but a lot more delicious. The club was also really good and a lot less carb-y. They do an awesome job toasting up the sandwiches and heating them through.\n\nNot super big, or super cheap at $10 (including chips and drink), but really very yummy. Can't wait until a location opens up in the LA/OC area!", "date": "2011-10-30 23:31:11"}, {"review_id": "kxUIZwZ2qXkVl2ORje6PoQ", "user_id": "IMKorVENsa_facyL_ger2Q", "business_id": "xEo-_CApwhR5cmJ47DdGkw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Unfortunately I cannot give -5 stars!! I rarely eat fast food but I'm not hard to please as long as I get what I'm paying for. This has to be the nastiest restaurant I've ever stepped foot in and I was so surprised it was a Wendy's. I've never been to Wendy's and the food was not fresh....EVER!!!! Granted it's been probably a year or so since I've eaten Wendy's. If this is what they've become then I'll pass. The floors were sticky and slippery, the customer service was ok at best and the food taste like it was sitting for hours. There were two soft drink machines buy only one dispense ice and the other drink and both of those look like they were not cleaned since they powered it on. When I went to refill my mom's cup I noticed the ice dispenser had black mold, I assume. I did not refill and at that point we left. Everything was sticky to touch or broken.There was a little 3 yr old girl that slipped while her mum was holding her hand in the order line. This really discourage me even more from eating fast food which is probably a good thing!", "date": "2018-02-12 21:45:01"}, {"review_id": "jW8w8sDFEBD5_Wu6U_B-6Q", "user_id": "nNVzXH7zcL80i-eB1yAxBg", "business_id": "avNUBfd-ZVCA0OkgEvaVqw", "stars": 5.0, "useful": 3, "funny": 2, "cool": 2, "text": "It took me over a year after I moved to St. Louis to finally make the decision that I could not fly back to my home state of New Jersey every time I needed my hair cut and colored.  So I bid adieu to my stylist back home, and started my St. Louis search.  After asking a friend's mom, whose hair always looks fabulous, she pointed me to Studio Branaca, and my stylist Steve.\n\nWhat a blessing!  He is an amazing stylist and all around good guy.  He really knows how to work with your hair and is honest about what he things will look good based on your face shape, coloring etc.  He also pointed me in the direction of Julie, my colorist.  Now I must digress and say that I trust my stylists totally...I mean that is their job, right.  So I put myself in their hands...which, with color, can be risky.  Well, there was nothing to worry about because Julie does great color...really thinking about the time of year, what you're looking for, etc.\n\nI've recommend everyone that is looking for a new stylist to go here, you won't be disappointed.", "date": "2010-01-08 15:37:47"}, {"review_id": "exfOzmbMx2uBuI1I0UHe-w", "user_id": "gq83kM9H94MlfPDFOeXjxA", "business_id": "LqaIFNWnwmy3PInuBDpAxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I love this restaurant! Amazing food and amazing service! The owner is such a gem! So nice and treats his customers so kindly! Also, best salsa ever! I always get the pollo en mole! Definitely worth your time to check out!", "date": "2017-02-12 03:47:34"}, {"review_id": "kUGIKCZfAady2YxR44J3cQ", "user_id": "VjVO1ILX6ZQFa4DOmfn7Jg", "business_id": "F8yozE3NWnImNApHO347gQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here twice. Once for a friend's birthday and this past weekend for my boyfriend's birthday/Valentines Day.\n\nLet me start off by saying that the food is amazing. There were no complaints in that department. \n\nHowever, I had made reservations for the later seating over a month beforehand. Because of budget stuff and the fact that we live in the suburbs, we really don't get out for things like this often and were really looking forward to a little romantic dinner. We arrived in plenty of time for our reservation. But because of overcrowding, we had to sit communally with two other couples. I wouldn't be so upset about this if we were told ahead of time that there would be a chance of this happening, but they decided after having us sit there in our coats for 10 minutes and didn't really give us a decision in the matter. It really did put a damper on the evening. Luckily, the other two couples were great people and we had some great conversation. And they did serve us as three separate parties of two, so we weren't sharing the plate with a bunch of strangers. \n\nBut then, they decided to include the mandatory 18% for parties of 6 or more despite billing and serving us separately, which was a huge slap in the face. Unfortunately, they lost out, because even when I tip low, I tip more than that.\n\nI love to support smaller businesses and this restaurant is truly unique. But I can't help feel sour about our treatment there. You would think that after being in business for so long, they'd figure out how to handle situations like this. It really is unfortunate.", "date": "2011-02-14 15:13:28"}, {"review_id": "Qz24R0QHyU0dVWStRSGzCQ", "user_id": "SrLubbVCO5NmVQTATq2ysA", "business_id": "BWITd9JUXP3gSi1z3Y-z8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ok so I went to this place several months ago, maybe January? And can't believe I haven't left a review yet. To be honest I don't remember the exact name of my dish but it was some type of truffle bucatini. There are no words. Just incredible. In full disclosure I'm a sucker for truffle anything, and pasta, so this was kind of a no brainer. Can't wait to go back now that it's nice out!", "date": "2017-06-09 00:43:39"}, {"review_id": "FaWMChNAmQLN0fCkbMLYqA", "user_id": "N2gv4Fw_axlt5lzkhVj1bg", "business_id": "-zXuVI8GB6lT4iU6KStOGg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "This is the place to take your car!\n\nMy Toyota broke down on me Wednesday. I needed to get my clutch replaced. The only thing is that I'm leaving early tomorrow morning (Saturday) to move out of town. You can imagine my stress. \n\nBuck himself was the one that helped me when I got my car towed there. I told him that I was moving so I was concerned about getting my car in time. He went above and beyond to make sure that I got my car this afternoon (Friday) which is so much more than I expected. \n\nNot only that, the price he gave me is at least $700 cheaper than the dealership priced it at. \n\nNeedless to say I'm very happy I took my car here. These guys really seem to know what they're doing and you can tell they actually care about their customers.", "date": "2015-05-15 22:16:18"}, {"review_id": "XHM0Svr9u8uJ8b1UA4LhmA", "user_id": "huzHapvnSZwNhsOjJsUeDQ", "business_id": "WWnRdTjwaTnsLSJX95j-Zw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is hot garbage. Never going back. Can't believe they let that dude Tristan walk. I felt as though he was the glue holding that place together.", "date": "2016-07-27 00:10:27"}, {"review_id": "mSak8gi0sFJUHeyaBTBf8A", "user_id": "kDcocx3taZO09tNfZXxVcw", "business_id": "LV61BcSaXlWsFR7_BJHJ9g", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "We booked this hotel through Priceline.com's name your own price.  This which was the first time we had used this service, so I was a little leary about how smooth it would be.  I was impressed with the ease of check-in, the indoor pool, and the rooms were nicely decorated and very clean.  The bed was super comfy too!  The next morning, I walked out of our room and then entire hallway (we were at the other end of the hall from the lobby) was filled with the smells of breakfast.  Gravy & biscuits, sausage, fresh waffles, and the usual cereal/muffin fare.  I would stay here again when in Nashville.", "date": "2012-11-06 13:13:39"}, {"review_id": "_EzBMMkKg2LQMP-N6g7rKg", "user_id": "OVjajJuKSEs7s6pl66CeeA", "business_id": "0zH0l4Jbf-oove3cLvrFOg", "stars": 1.0, "useful": 2, "funny": 2, "cool": 1, "text": "Went last Friday night for a 7:30 reservation. Left outside standing in the rain waiting to 8:30.  We were a party of 6 for dinner. No one seemed to care or would give us a reason for the long wait. Phoned Florintinos in Newtown they told us a table would be ready for us  in 5 min. \nWe had an amazing dinner and won't be back to the other place again.\nLove Florintiono's thanks again for another wonderful meal!", "date": "2012-06-07 04:33:43"}, {"review_id": "5hwKlfyEUz6DJZiOuiFqAQ", "user_id": "23mUvv0YG8QFFRWvgk6WsQ", "business_id": "MMRRS6YhVRx_iN5-JhMRYg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very authentic,  we had extreme heat cabbage and three cup chicken. Finally a place with real Chinese food. We loved it. No room for dessert. Have to come back.", "date": "2016-10-02 16:39:11"}, {"review_id": "fOdLtXtkOLYwPtVN3RA-Pg", "user_id": "75txIdyxFi6i3GX8MF_egg", "business_id": "phhhWAJiNCVeTMJPNoR8Bw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Walked in for a pedicure and gel manicure. I was taken right away. The guy who did my nails took his time and really cleaned up my terrible cuticles. They were friendly and reasonably priced ($57 for pedicure and gel manicure). They also have the powder option available too.", "date": "2017-11-09 12:39:41"}, {"review_id": "huzNnfb6A9L5xqeKY6k6Uw", "user_id": "pU90CdIC7UGc_Lv9NdLojw", "business_id": "Z_7GMx9mPm2J_pd8EZ907A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "After being offered 3 different rooms all with dirty faults and worn mattress we cancelled our reservation and left , I would not recommend staying here !", "date": "2016-10-01 16:02:51"}, {"review_id": "0Q4velGF_UzuOVRTzSWp4A", "user_id": "fBsU-wHzo9JzpOTIJC1B9Q", "business_id": "sr-5EY6bmp4jINhea06MjA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Everything is covered in pink, including the glittery baked goods. And everything is a bit pricey. It's really a treat yourself type of splurge. It gets crowded and the tables are tiny, so plan accordingly. \n\nAs for the food: \n\nCakes- heavy on buttercream frosting, so your experience partly depends on your cake to frosting ratio preference. I prefer less frosting, even though this is a quality buttercream.\n\nMillionaire cake wasn't bad, but the vanilla frosting overwhelmed the more delicious shortbread. The raspberry cake was better as the preserved really stood out.  The passion fruit coconut cake fell short of my expectations and was just unimpressive despite my excitement for such summery flavors. Cookie dough cake was great and packed with cookie dough.  Cookies and cream was too buttercreamy. The earl's court is great and super rich, so definitely for a chocolate lover. I have no complaints about too much rich, dark, chocolate buttercream.\n\nNoncakes - The berry topped cheesecake was gorgeous and yummy. And the coconut cream pie was the silliest I've had. It made up for what it lacked in coconut flavor with its buttery smoothness.\n\nThe latte was decent, but not great for the price.\n\nFrench bread and salted butter may be the best thing on the menu. They're excellent! And my kid loves the buttered noodles.\n\nI've visited with different people, and the staff has always been very friendly and welcoming to us. Bonus points for service.", "date": "2017-03-29 20:11:35"}, {"review_id": "TePAbX_VU6CHYdlk7DIFCw", "user_id": "pz8JBn6q0DboXKfuNFaubw", "business_id": "CAnV18mOhhpQYlOqF40-Dw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is horrible do not stay I'm here right now and I want out worst room I've ever stayed in and its not even that cheap horrible", "date": "2012-08-20 20:43:13"}, {"review_id": "DDgOGSWPUwv4kHrgdxEx_g", "user_id": "KrIobxBMoPgt740h8mWZ5A", "business_id": "RqeokGq-qSYlk7WA4WF6sA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Horrible customer service!!  Do yourself a favor and go to Hertz down the street.", "date": "2016-03-10 17:58:39"}, {"review_id": "uWoYCcIoZoRE6SSzwZfe2A", "user_id": "xuPSurxhASXZFsMJk2cVMw", "business_id": "PY9GRfzr4nTZeINf346QOw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "We stayed at the Tuscany Tower part of The Peppermill Resort.  A VERY long walk from parking garage to the non-smoking Tuscany Tower via the very smoky main check in area of The Peppermill.  Ash trays at each elevator floor, even though the Tower is supposed to be non-smoking.  Air conditioning did not cool the sleeping area of the room.  The bed was like a slab of concrete.  I expected more from a \"newer\" 4 star hotel.  The restaurant across from the pool made 3 of us ill, even though we all ate different food.  AVOID this overpriced place!", "date": "2011-09-26 21:21:59"}, {"review_id": "lgnMsOWdTCnwV4Scbanmxw", "user_id": "z5EoV5rVyWdFPDIdvylvfg", "business_id": "qiZ60gI5LCzhkW59cmrFoA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Just never changes  we tried  this place again after 12 years. Cheep cheep they just want to take every dollar from you.", "date": "2016-02-27 01:10:28"}, {"review_id": "fWdsbjyYZgL1wZYs1KHS9g", "user_id": "DfgEU2OEXvT8yQi_y3PtNw", "business_id": "bMratNjTG5ZFEA6hVyr-xQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We were thrilled to come across this tiny little neighborhood gem!  Although you'd never know it based on the location, this is a great little restaurant where they make you feel like family.  We had the calamari, ensalada caprese and shared the pork braciole special and gnocchi.  We finished up by sharing a small plate of cannoli.  Everything was absolutely excellent!  Not to forget, it's BYOB too.  I'm looking forward to going again and bringing friends.", "date": "2015-10-29 01:43:34"}, {"review_id": "S2SyQSOn2hgy4fYFA1xfuA", "user_id": "Unk0vlfw3QrPrslXnXWSSw", "business_id": "EQ-TZ2eeD_E0BHuvoaeG5Q", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "What a unique addition to Indy! I had been wanting to stop by for awhile now but I am sort of a picky eater (I know...I wish I wasn't!) but I finally made my way there to give it a shot. Lucky enough, I found the Lamb patty melt on the menu that was calling to me. Amazing. Such a delicious sandwich with a side of quinoa grits with an egg, bacon and scallions. Coffee was good...I enjoyed the Crunch Berry Cappuccino. What a fun idea!\n\nMy one complaint is of course, the no exception rule to asking for an alteration on a dish. As a sometimes picky eater, that may steer me away from returning to try other items on the menu. And the food can be pricey. I left spending much more than I anticipated.", "date": "2015-04-29 01:27:27"}, {"review_id": "Emk8KhaBKn5d8gujleUoww", "user_id": "UMJNpNWZf_GC-Udx7K32WQ", "business_id": "eMiN8nm70jjKg8izikVWDA", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "not even happy with this place. here from out of town.  came to see our team play. stupid white girl hostess gave. my table to another party because since we were all black she thought they were with me. REALLY!! so after three loud complaints and LOTS of B.S our game 30 minutes later is on . not happy at all. i will not be back nor will i EVER reccommend:-(", "date": "2011-10-09 17:39:49"}, {"review_id": "qZnqtZTrCM7wF6MSRnn8aA", "user_id": "ssfQasEoYMttNt0M_Sstyw", "business_id": "Z2LtuIH3Sthc49Pi3Yg8Jw", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "I was skeptical when I walked in since the place is outdated, however I was very happy with the way my pedi and gel nails turned out! My gel looks exactly the same 3 weeks later(besides its grown out) normally at other salons my gel would start to peel up or come off after 2-3 weeks. I didn't have to wait, woman was friendly, and the overall experience was relaxing. I may have found a hidden gem.", "date": "2016-06-24 13:05:05"}, {"review_id": "KQaT2TlNakA1UjgDEYGGtg", "user_id": "mYUldhYr9vJQ-Zwl88WDDQ", "business_id": "j99PtxlKTW_u5alE4jiqHQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Out of town visitor came here based on a colleague's recommendation. The food was amazing! The Salmon was as good as I've had in years. Lots of flavor and cooked perfectly. The pasta was equally as good and the marinara was outstanding.", "date": "2012-01-07 07:21:32"}, {"review_id": "YzFh1HJRX5NuNi6Yr05xHg", "user_id": "YfxcaQ_Z6z8eGdT_NDN1uw", "business_id": "C4lZdhasjZVQyDlOiXY1sA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "It is a nice little Mexican restaurant in a strip mall. I thought the decor is colorful and happy. Our waitress was super nice. We got beef and shrimp fajitas. They were really good. The prices are very reasonable. The only bad thing I can think of is that they do. It serve alcohol. All in all, we had a very enjoyable meal there.", "date": "2017-01-28 23:37:59"}, {"review_id": "gtdjCO3DS-SnoIwaxHXjbw", "user_id": "UuMlHRep19rSOo5B-QZkKw", "business_id": "azEWQ-v2J-Y-K4rXeaYf_Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "So thrilled to find this delightful shop! I purchased a kit with yarn and pattern, but had some problems with the directions. A phone call to the store cleared them up quickly by the helpful lady who answered. Awesome.", "date": "2015-04-01 15:45:24"}, {"review_id": "ZwpTPHDcRspVFD1WQ_hAVQ", "user_id": "tIYZKyFl4Vt_RS72v4YT0Q", "business_id": "mHDBZmEH0Er3184YS83_LQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I stopped to get a full detail done and I even added on some extras and the price was still amazing. I got in immediately and by the time I took my child to the play park for an hour and came back it was done shiny and ready to go five stars all the way around", "date": "2018-09-26 14:42:54"}, {"review_id": "4aBqqgmNfl2MI6WytuLBiw", "user_id": "bBd8sOgkhbaEeZHjczV8ZQ", "business_id": "8FALz8g6oaTca0ufiUuF6w", "stars": 4.0, "useful": 3, "funny": 2, "cool": 1, "text": "I'm not a fan of the bar scene, but if you find me in a bar, it is most likely divey or gay-friendly.  Tabu fits both of these criteria.\n\nI met a friend here who had moved out of town. There was plenty of room at the second floor bar. It was dark, a cool respite from the boiling May heat wave, and half-full of very relaxed patrons. I ordered my favorite non-alcoholic drink of the moment, seltzer with a splash of pineapple juice, and spent the next hour and half catching up with my friend while listening to the somewhat overpowering sound system blast a mix of 80s and current pop. It was really nice to go to a bar where you didn't have to worry about ordering another drink every 5 minutes. Also, although it was described as a gay/straight sports bar, they were playing a Sex & the City marathon on their large screen TV which is way more fun than watching the Phillies, at least for me, a total non-sport fan.", "date": "2013-05-31 15:19:09"}, {"review_id": "y7AwRacp5k41OcpcCMeNog", "user_id": "pARrANccOOE1hdJBsOXOrA", "business_id": "oRZzKWdyMQld6N_y4UWkAg", "stars": 4.0, "useful": 3, "funny": 0, "cool": 3, "text": "With not much experience with Peruvian food, I was not sure what to expect. Although after taking a look through the dinner menu, I sure had an idea of what I wanted to order.\n\nWe started with a few Entradas - Papa a la Huancaina, Terra Sur Calamari and Causa de Pollo. Out of the three, I have to say I enjoyed the latter the best. The calamari was good, not the best I've ever had, and it was so large it looked more like onion rings.\n\nThen we ordered some main dishes, which turned out to be my favorite part of the meal. Between the Ceviche de Pescado y Camaron, Anticuchos de Carne and Paella, I couldn't decide what was the best. The Ceviche was delicious, the steak was seasoned perfectly and the Paella was one of the best I've ever had.\n\nThe atmosphere was quiet and more quaint, so probably not the best place to take a large group, but I was in a small group of 4, so it worked well. There was a lot of cool art on the walls, so interesting to look around, but also had an authentic Peruvian feel, which was a nice change from some of my regular haunts. Terra Sur is also a bit off the beaten path, so if you're not looking for it, it may be hard to find without a recommendation.\n\nI'll be back for future visits I'm sure as there are a number of other menu items I'd like to try.", "date": "2011-12-07 02:09:13"}, {"review_id": "hmfU0G-ZvLFEiwzMdwA0pw", "user_id": "vSmdS3OuVmtmbg8r1BsDlQ", "business_id": "luXBhJkuhBAKNCjByulizA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent food and service. Loved that I could order my own turkey burger the way I like it! We will eat here again!!!! Location was easy to find!", "date": "2013-09-10 06:51:24"}, {"review_id": "WsG57u9DM8S4W2ViQweCHg", "user_id": "--_H9j6ggxvqhh9nPofZwg", "business_id": "j0tHKpa2I2pj3uuxCmrgWw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of my favourite places in Edmonton to eat! The food is awesome!!! We even had it as a dinner club with work as a payoff as its so delicious.\n\nDepending on the time and day you want to go, I highly recommend making reservations. It is downtown, so parking can sometimes be a bit tricky. You can normally find a place on the south side of the building in the lot.\n\nIf you're looking for a business ambience or private meeting room in their library than this is the place to book. If you want a bit more romance for a special event, get a seat close to the fireplace. \n\nThe wait staff is on top of their game and the chefs leave you fully satisfied. They try and incorporate local as well which enhances the freshness. Never ever have I had a bad meal here. \n\nAlthough I haven't stayed in the hotel, I hear it's nice and they do specials with the restaurant as well... One day.", "date": "2015-09-25 06:10:47"}, {"review_id": "HbpoI6ZOTSpJaSCyhH4r7w", "user_id": "uTCdsZGQt_PcJmcC6Df-mA", "business_id": "cIohvIbTq6qN7god-sx1zg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Stopped in for takeout, service was fast and pleasant. The price was good for the area. Burger was cooked to order and seasoned well, portions were large. All in all, a decent place. I will return.", "date": "2016-05-09 02:46:01"}, {"review_id": "PMyaBOzvt-K7y_hvACb31w", "user_id": "cPd6T7GZi1BMgWzBU55xAw", "business_id": "ZDg4siM2zLF4Rt8ZTqR8BA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was searching for a good hoagie place rather than doing Primo or Wawa for an evening bowling event at Devon Playdrome.  I found this deli did trays so I ordered a tray and a few other different hoagies to accomdate the group.  The woman who took my order was very helpful in trying to figure out how many sandwiches were needed to feed our total amount of people. The food was very tasty and a definite reason to stop there for a sandwich at any time.  We'll be having more bowling events and will be sure to stop back again the next time or sooner.", "date": "2015-01-19 15:40:28"}, {"review_id": "ZjbD-oiRpvj3Yw7ElTOhtw", "user_id": "9hfWfb522BxwymuPan4dKQ", "business_id": "NQSnr4RPUScss607oxOaqw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely love this place. Come here atleast once a week during my lunch hour and Frank and his staff are great. Food selection is always interesting and beer selection is great. Excellent food and drink for an even better price. Kudos", "date": "2016-07-15 16:09:57"}, {"review_id": "1F7gqyYtyjzDlOjLAuOnvg", "user_id": "fGWE6WRFHLBOzrRycoyfpQ", "business_id": "TK9x9sCWRDwtiV5UAzrRTg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The Vietnamese sandwiches here are sooooo good. So good in fact that my boyfriend and I haven't tried anything else on the menu because we can't pass up a barbecue pork Banh Mi sandwich!!!! The sandwiches are fresh tasting and perfect balance of meat and vegetables.  The prices are very reasonable .... If you get a 12\" sandwich they throw in a can of soda. The one bummer is that the restaurant shares space with Port O Subs... So it has a low end / fast food vibe.", "date": "2014-01-18 21:23:23"}, {"review_id": "mmukRn-8su6v01MZyRf1rw", "user_id": "hW4K6IeOpu4kHmIplSJVPQ", "business_id": "NA3oFJQBle5iulhYu2b1tA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "So delicious. Not fancy,  and decor is still a work Iin progress,  but if you want a delicious burger at reasonable prices,  you have to go to Isaac's. We tried the dry rub wings,  a little roughly cut but delicious. The blue cheese chili fries are to die for. Defiantly going back.", "date": "2017-10-28 16:44:16"}, {"review_id": "u4SKhfalt68UriJXHpAghw", "user_id": "_ea3KrcIg11n2TyIuGQjtA", "business_id": "HCqmx4ENAZ76SAjoalj-MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We stopped in here for lunch today and it did not disappoint. Our server was very informative and very welcoming! Our group ordered a mix of things.. some of our favorites were the fried green tomato but (she added the egg and cheese) , the homemade chicken salad sandwich (I ordered this and honestly, the best chicken salad I have ever had. Everything just worked so well together! Great flavor!!), also the blackberry cobbler. The dessert just felt like home. Pure comfort food! We loved the vibe here and it was precious inside! Thanks for the great experience!", "date": "2017-08-29 01:42:01"}, {"review_id": "aCV-t-O8T0Yg8D3qRAU_OQ", "user_id": "z2NJ7s9BzZBQcwlgpcWLJw", "business_id": "TDKBPcViJQDMrdUm6a9XZA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really do love the depot and unfortunately everyone else in Reno does too. The price point is a little high for an every day type of place but the food, drinks and atmosphere are great. It is built in an old train depot as the name implies and is soo cool!", "date": "2018-09-04 04:29:36"}, {"review_id": "YCquQDz8ravNUkZL72ZtUA", "user_id": "6lNLOZHzaxsPp2PRi6w6rg", "business_id": "5JiFbBsbUdb-caBZWRyMSw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love the whole concept. We had such a great experience here. The food was delicious. Our waiter was the best. We ordered cheesecake which was even better. I can't wait to come on the day they make cinnamon rolls. We will defiantly be back.", "date": "2018-10-04 13:13:55"}, {"review_id": "9kN6lj1Td0z8gcMk464_tQ", "user_id": "o22x7tpqwrTPIDUpnrR4lg", "business_id": "HTqXI5S2XcSlh_ylx9sE6g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Oh, that tiramisu! So good! Parts of it were a little dry, but I still give it 5 stars. Kind of pricey though. Next time, I'll probably try the cheesecake.", "date": "2014-08-10 21:42:26"}, {"review_id": "_um0AG7txktS-9g3VB1Pug", "user_id": "jn0IlshjEmN3R8vPJOo8uw", "business_id": "dyVKL3qKsz_XDxtjpbNcgQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Traditions in place, I want to love this place.  I watched it grow from ground up.  As a longtime native, El Charro was \"the place\" to take visitors, and to just get yummy Mexican.  This is the 5th time here, with lackluster results.  Salsa, has lost the yummy factor, chili rellenos lacking any real flavor, etc. for beans, even chips!  If the goal is to reach out to the general tourist  public, this is the p,ace.   I will say house margaritas are delicious, and service is spot on.", "date": "2018-03-24 05:16:43"}, {"review_id": "Z9w-fl9mKYEij1z3TdZDlg", "user_id": "Rdoq6Ky9UTr58PewXvjP6Q", "business_id": "Juoz1CK-bqCNFtOA02BtjA", "stars": 1.0, "useful": 3, "funny": 1, "cool": 1, "text": "I had cookies there on my vacation while visiting family.   I think I would have gotten better cookies if I would have gone to Ralph's and picked up a pre made dozen.   I don't live in this city so I guess I cant make a return recommendation.", "date": "2010-10-15 21:07:06"}, {"review_id": "yHW0wfBZkfyFekw99Tuc-Q", "user_id": "FVIo_gzPb0j2cy0rz0q2eQ", "business_id": "ugNplY4SZqIfP417oUxahQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "i woul have given 4 star but their fries are not fried enough.   i wish they would fry it little more, they were very limpy", "date": "2017-10-03 00:46:44"}, {"review_id": "s_fph3XBHQQL4Tk5YmQ6rQ", "user_id": "bc_HPx4CLPIvDuRvnLTq5g", "business_id": "x7_p5O3ChQa7shdHCcLHZQ", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "Ugh, what a disappointment. My husband and I love creole, Cajun cooking and had such high hopes for this place. We had heard great things. The appetizers were great, the bloody Mary's good and the service was fantastic. So why only two stars? The entrees were not good. I had crab ravioli and it was ok. Decent sauce but not real pizazz. My husband had the jambalaya and cat fish and to be honest it seemed as if it was left overs. The jambalaya was horrible-old. The shrimp and sausage were falling apart as of cooked way too long and there was just no flavor. Very disappointing.", "date": "2014-04-20 20:35:42"}, {"review_id": "urs3edD8UkVDB2riqEiOcg", "user_id": "DGtR4pYJR86mCZ08oI39pw", "business_id": "UCMSWPqzXjd7QHq7v8PJjQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "The food here is good, not great.  It is very busy during brunch, if you arrive around 1 pm you should have no problem getting a seat in short order.  I ordered the Monte Cristo sandwich, I did appreciate the french toast for the bread but the ham was a standard supermarket lunchmeat.  My dining partner had the breakfast sammy and was happy with his choice.\nIf you use the Yelp app to secure a place in line, you will check in with the hostess at the time requested and should still have another 20+ minute wait.  Not as reliable as an open table reservation but thankfully they have the option.", "date": "2018-02-12 19:16:35"}, {"review_id": "OB075YtxezLHubPKDhB6vQ", "user_id": "9onoe9mh0ms7Ck6brIh-yQ", "business_id": "fnO03-RX7UDC1TzXETWEsQ", "stars": 2.0, "useful": 2, "funny": 0, "cool": 1, "text": "Over priced out dated beer selection.  Several of the beers I picked up were over 6 months old and many were over priced. It's packed with rude hipsters d-bags standing around in front of the coolers sampling beer. Talking to the inattentive miserable employees, who act irritated if you ask them a question. Parking is also atrocious. Better options out there", "date": "2017-12-31 16:52:23"}, {"review_id": "s8n1aw_UsuiIgSvQDI6rYg", "user_id": "l2JpmmYO-5OXSYehBvTfcQ", "business_id": "_rkjLrft2ZgHcLBLF9amXw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Went here for dinner purposely at an off time.  Highly disappointing experience. The food was ok, the service started out strong then went down the drain. This is on a Tuesday night at around 4:45. . . \n\nMy friend's  ice tea glass sat empty for a long time- the server never came to check to see how our food was until we were practically finished.  I got the wrong dressing but the odds of getting our servers attention was slim to none.  I gave up.  We flagged down the hostess to bring an iced tea refill- several more minutes went by while we were ignored. Finally the hostess walked by and saw the ice tea still hadn't been filled up so she said she would bring it herself. Only after that did the server come back to check to see how everything was. \n\nThere seemed to. E a lot of unhappy customers and food issues. Another table apparently got the wrong food. They had to get their pizza remade etc. it seemed like a rough night. \n\nVery hit and miss- super inconsistent. Frustrating experience.", "date": "2017-09-21 23:49:47"}, {"review_id": "M15a7XBmp-AjwkaqD_B3Ow", "user_id": "MgIas0VxXJlUsagsYzEzeg", "business_id": "V378VWx4D8BstWNRFwDULg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here opening weekend and was not disappointed after waiting in line for an hour. Matcha is my favorite! I always bring my friends who are in town visiting. They love this place!", "date": "2017-05-16 00:11:19"}, {"review_id": "MvP3pBK1hC_JXIqECX9YGw", "user_id": "SAkxCZBw0IA2n6Yqz6pQVw", "business_id": "g3LweOTJlJoALtaShN4SLA", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Decent service. Food was bland. I'll probably find somewhere else to go next time. It seemed really slow so I'm. It sure if that is indicative of the service or food.", "date": "2017-10-26 01:10:47"}, {"review_id": "N6Unhe81q87SlFmjBXqYGQ", "user_id": "flodaXReIRBS7zp4nuYgbQ", "business_id": "_5_xybRFzDlvIkK_y10Iww", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Our reservations were mysteriously cancelled upon arrival, instead of handling the problem, front desk staff tried to turn us away as the hotel was \"full.\" When I demanded we get the rooms that as of two days prior were confirmed, the man behind the counter claimed that was impossible. When I asked to speak to a manager, both gentlemen at the desk claimed to be managers. They then teamed up to make all of this seem like our fault. They kept saying they couldn't help us when we were angry, but what they were really doing was attempting to bully us into leaving through angry and condescending behavior and speech. One was especially bad. He had what seemed to be a violent temper. He had to walk away at one point and compose himself because I wouldn't just accept the fact that our reservations were lost (did I mention my colleague had checked in under the reservation two hours prior?) He was scary, and probably does not need to work with the public. He seemed proud of his behavior, like he could treat me that way because I was powerless. I asked him to call the reservation line to find out what happened. He held the phone to his ear for a while, said he was on hold and that he could call me when he knew what happened. I gave him my cell phone number. I went to our to put down luggage in the rooms they found us that had previously not existed, and when I walked through about ten minutes later to move my car, he was not on the phone nor had I received a call. I asked him what happened and he said they couldn't tell him anything. I told him I didn't appreciate how he had handled the situation, and as I walked away he yelled at me to mention his name when I called to complain. Why would a person say that? No concern or compassion for customers. I think he was mad that made a mistake and had to work to fix it, which is his job. What's really upsetting is that when I called the corporate reservation line later, they said I had had three rooms when the reservation left their system the day before. \n\nI would never stay here again. I felt like the staff couldn't handle a mix up that most likely happens on occasion. We were not going to leave after our colleague was already able to check in, with no place to go and no idea what happened, and the hotel must not have been \"full\" if they found us two rooms for the night because we wouldn't leave.\n\nThe rooms were below average, but the scary staff is the reason to stay away.", "date": "2015-11-07 12:55:48"}, {"review_id": "oBn2QAsdi0DryaUbyDTsEQ", "user_id": "4Psac6uj06y_5EPv6CL56g", "business_id": "9FxJE_UeJMlEKn7g7qkc7Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "This is the closest grocery store to my home.  The employees are very friendly.  I have never had any issues.  Last night, the cashier actually inspected the bag of spinach, saw that it was wilted, and sent the bagger back to get another bag.\n\nGreat customer service.", "date": "2012-02-01 12:59:43"}, {"review_id": "u1wLsg-BqrPBsyo75_w57A", "user_id": "TTibuRAx2gxu-nVAymFijQ", "business_id": "ltBBYdNzkeKdCNPDAsxwAA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Had a wonderful dinner at the tavern I had the chicken skewers, they we're delicious, wish they had more veggies in them however. But still they were great! My girlfriend got the Mahi sandwich and said it was perfectly blackened a Cajun tater that paired well with a creamy cucumber garnish, it was all really delicious! I got the house made cocktail \"Amerboire\".  So good I got 2!! Natalie was our server and she was so helpful and great! Made us feel right at home in Nashville! Can't wait  to come back", "date": "2015-05-15 23:29:04"}, {"review_id": "-IrBFdDsocz39FBRxuW6PA", "user_id": "zg868OaUB7y8eowPiyKkZQ", "business_id": "YOEsOaiV0AznLshMDg5bJw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Locally owned shop for tires which are critical for cars! Wish they had more brand options in house but they can order you almost any tire you like. Local folks doing good work at decent prices.", "date": "2018-04-29 03:32:54"}, {"review_id": "T9zLYVN5OQOrTxtn0GDVqg", "user_id": "Nnz2QtnXOfPxvHO95oAYXQ", "business_id": "VRnJgj0IvxoksHppE78X2Q", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place had slightly above-average Americanized Chinese food, with even a few nods to real Chinese cookin' thrown in (veggies w/ oyster sauce, salt baked squid).  Some dishes are good (hot pot), some are not (Szechuan anything... really just icky sweet & sour sauce with a dash of hot sauce & ketchup).  However, if I want takeaway food I'll order out from my local place.  If I'm going to walk all the way to C-town, I want the real deal.", "date": "2009-06-06 17:02:43"}, {"review_id": "qmpJLvcppje7bj2XT553aw", "user_id": "uL1KpjpFnpvS-_vWzQKxjQ", "business_id": "HTJWXGmZA5dCBV9ylvLjUA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We used BAS for a move-out cleanup.  We lived in a row house for five years, had a great landlord and wanted to leave the place cleaner than we found it.  Based on other reviews, we called BAS Cleaning Company.  They were spectacular--four super hardworking and fastidious people did everything you would want a cleaning service to do, and more.  BAS's owner Abdul stopped by a few times to see how things were going.  Aside from cleaning, the crew was friendly, asked questions when appropriate.  The price was fair.  I was 100% satisfied.  And yes, the house was cleaner than when we moved in!", "date": "2015-05-15 14:47:04"}, {"review_id": "184SYUpisfb-WeMAr4x8mA", "user_id": "kDeyHdQGVGdqYM11Q6lMTA", "business_id": "cN8F-BmoHoS9eCqIHMtlHA", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "I absolutely love the french toast and the baked eggs. Both are baked in loaf pans, and you get a thick slice (imagine something like a meatloaf...and they give you a slice that is about 3 inches thick). The eggs also come with the kinda of toast you would expect from a bakery and some fruit. \n\nLunch is good too, but I would get breakfast 100% of the time if they served it all day. \n\nMy only complaint on this cafe is that it feels very much like you are in Clayton...the clientele clearly has money. I've never seen anyone just hanging out with their computer and taking advantage of the free wifi. It's more of a place where sophisticated people go to enjoy a leisurely lunch. \n\nI wish the CWE location hadn't closed...it had the people and the food I wanted, and camping out for hours with a laptop felt normal there. \n\nThe Clayton location does have a small patio area, and I am impressed they went to the trouble to put outlets into the columns. I was also there once around 2 pm, and they were dragging a rack of old bread out to throw it away (seriously...why isn't it being donated!)...the staff person looked at me, my companion and one other woman sitting outside and told us we could take as much home for free as we wanted since it was going into the dumpster. Not sure if that is normal or if we just hit a nice employee on the right day.", "date": "2011-07-03 04:33:06"}, {"review_id": "jiho396pxu4JUZO-4fqxsQ", "user_id": "eENfwrVhvOj5t7Gt1IKKAg", "business_id": "zy7uNOvpykrq-XlmDY_wHA", "stars": 2.0, "useful": 3, "funny": 1, "cool": 2, "text": "Being new to the area I don't know about many places so I'm always excited to try a new venue.\n\nI was here during the happy hrs of 5-7pm. I ordered the mango martini which was actually good..the peach wasn't that great.\n\nBeing broke I opted for the half off appetizer specials.\n-Coconut Shrimp\n-Chicken wings\n-Catfish tenders\n-Cornbread\n\nFor some reason, all the items tasted \"not fresh\". The shrimp was chewy..tasted like pre-cooked shrimps that were then fried in the coconut batter. Def did not taste like it was made fresh when i ordered it.\n\nCornbread...DEF NOT FRESHLY made..tasted like yesterday's cornbread.\n\nBasically everything I ate was not freshly made.  I understand that I was eating on the \"half off\" special but geez I've ate at other places with \"half off\" menus and the food were freshly made and delicious.\n\nAnyway, I was not impressed. I expected something way better...oh well, onto my next venue.\nThey had a parking lot right next door which i was very excited to see. Its a large place and I liked the decor...hopefully they improve on the quality of the food.", "date": "2008-09-06 16:16:44"}, {"review_id": "D4oLijNQn0YCqqLwvC0lHQ", "user_id": "AdebHGtVVKpkgrV_2a9Ekw", "business_id": "w5VWdlVKW8FPF6AFk2JrOg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not really sure what people expect from this place. It's a cheaper brand of hotels in not the greatest part of town. For what it is a CHEAP hotel located conveniently by the airport it's pretty good, it's attached to a 24 hour ihop and right next to a bar. Staff is nice, rooms are decent not great. As far as value for dollar this place is great.", "date": "2015-01-06 09:02:50"}, {"review_id": "v-Tr-P_p7iBLWnEBWGNHBA", "user_id": "-yi2FGx5DkuGCkBAniQBqQ", "business_id": "skN2XhKXlcjf53uIwzAedw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We had a great experience today at Burger Up! Our server David was awesome. He realized immediately that we were kind of in a hurry, so he took our order quickly. He was super friendly and made sure the girls and I were well taken care of!! \nThis is why Burger Up is one of our favorite restaurants!", "date": "2016-10-15 21:08:29"}, {"review_id": "pbHLAnNm4EomNxioxyuafA", "user_id": "t0IXXAElJJ1TxaWmSFOJeQ", "business_id": "7EhTT4iEuA7JaaWA-eI3Qw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We were really surprised about this place! We had no idea what to expect, we didn't realize it is a Vietnamese restauaurant. But we love all Asian food & decided to try it. Plus, they have tons of Boba drinks to choose from - YUM. The place was pretty busy, even on an off time of day. And I always think if I'm in an ethnic restaurant and there are a lot of customers of that ethnicity, then it must be pretty good.  We both really liked it a lot!!!!!", "date": "2015-08-08 17:39:23"}, {"review_id": "vjYlN3_JfAiFNN_xWEviVQ", "user_id": "6GhA0dm_JKWfsKwtdn3TYQ", "business_id": "oQ5CPRt0R3AzFvcjNOqB1w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great lunch!!  We saw all the people eating here so we decided it must be a good place to go!! The food was amazing !! We took other's advice and tried it all!! Mac and cheese was great so was the banana pudding.  I had the Chilean sandwich and would skip the bun and the slaw next time. The French fries were amazing !!", "date": "2016-06-22 21:10:35"}]